[
  {
    "source": "Garchomp is a decent setup sweeper that can use the combination of Loaded Dice and Scale Shot to boost and deal damage at the same time. Fire Fang hits Ferrothorn, Mega Scizor, and Corviknight, OHKOing the first two at +2. Tera Steel grants it the ability to ignore Toxic and set up on passive foes like Alomomola and Galarian Slowking, while Tera Fire gives Fire Fang a STAB boost and allows Garchomp to become immune to burn from foes like Rotom-W and Moltres. Both Tera types flip the match up against Fairy-types like Iron Valiant and Tapu Lele, both of which can heavily threaten hyper offense teams which Loaded Dice Garchomp mostly finds itself on. Teammates like Volcarona, Raging Bolt, and Urshifu-R appreciate Garchomp threatening foes like Dragonite, Clodsire and Toxapex. Garchomp requires support to set up and sweep due to its typing and Defense drops from Scale Shot, so it is very helpful to have dual screens support from Tapu Koko and Grimmsnarl. It also struggles against common threats like Tapu Lele, Iron Valiant, and Weavile, which makes Mega Scizor and Iron Valiant good partners with it. Landorus-T can pivot around Garchomp pretty easily, which makes Mega Scizor a good teammate since it can frequently force Landorus-T in and wear it down. Unaware users like Dondozo can completely shut down Garchomp, so it benefits a lot from immediate breaking power from teammates like Raging Bolt and Tapu Lele, the latter of which can also protect it from priority moves.",
    "target": "烈咬陆鲨是一个不错的清场手，它可以通过机变骰子和鳞射同时提升速度并造成伤害。火焰牙可以打击坚果哑铃、超级巨钳螳螂和钢铠鸦，并能在攻击+2后OHKO前面两位。太晶钢让烈咬陆鲨免疫剧毒，使它得以对着保姆曼波和伽勒尔呆呆王等被动的中转强化，而太晶火给予了火焰牙属性一致加成并让烈咬陆鲨免疫来自清洗洛托姆和火焰鸟的磷火灼伤。两种太晶都能扭转烈咬陆鲨对铁武者和卡璞·蝶蝶等妖精属性宝可梦的相性，它们都能威胁烈咬陆鲨常在的ho队伍。火神蛾、猛雷鼓和武道熊师-连击流等队友欣赏烈咬陆鲨解决快龙、土王和超坏星等威胁的能力。因为鳞射的降防特效和自身属性，烈咬陆鲨需要队友的支持以强化或清场，所以可以携带卡璞·鸣鸣和长毛巨魔等能为它开双墙的队友。超级巨钳螳螂和铁武者能够帮助处理烈咬陆鲨难以对抗的卡璞·蝶蝶、铁武者和玛狃拉等宝可梦。超级巨钳螳螂也可以吸引能轻松中转烈咬陆鲨的土地云-灵兽登场，并帮忙消耗它。吃吼霸等纯朴特性的宝可梦可以完全挡住烈咬陆鲨，所以猛雷鼓和卡璞·蝶蝶等有优秀破坏力的宝可梦也是烈咬陆鲨优秀的队友，后者还能帮助烈咬陆鲨防住先制招式。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]