[
  {
    "source": "Since Tapu Koko is commonly seen as a mere Terrain setter and pivot, it can catch opponents off guard with Choice Specs, luring in Ground-types like Landorus-T and Gliscor and heavily denting them with Hidden Power Ice. Once Ground-types are eliminated, Tapu Koko can also start spamming Volt Switch to overwhelm foes, dealing large amounts of chip damage to facilitate a sweep from allies like Iron Valiant. Additionally, its high Speed and Electric Surge allow it to function as a fast pivot that enables Quark Drive Pokemon such as the aforementioned Iron Valiant and Iron Moth. Dazzling Gleam is a secondary STAB move that can be used as a safe mid-ground option to hit Ground-types for decent damage when using Hidden Power Ice is risky, and it also hits foes like Mega Latias and Zamazenta harder than Tapu Koko's other moves. Tera Electric allows Tapu Koko to clean up with Thunderbolt once Electric-immune foes are defeated, but Tapu Koko should still primarily be used as an enabler for allies like Iron Valiant and Iron Crown and thus should generally not waste Tera. Choice Specs Tapu Koko should be paired with allies that benefit from Landorus-T's and Gliscor's absences. For example, Iron Crown has a much easier time setting up without worrying about a stray Earthquake, Iron Moth has trouble with Gliscor and benefits from its absence as well as the presence of Electric Terrain, Hawlucha becomes a deadly sweeper with one of its biggest checks removed, and Iron Valiant's Swords Dance variants become very potent without Landorus-T to stop them. There are a few defensive Pokemon, such as Galarian Slowking and Ferrothorn, that can stop Tapu Koko easily; therefore, teammates that can threaten these foes such as Weavile and Iron Moth are useful. Finally, entry hazards are useful to whittle down Gliscor into KO range of Hidden Power Ice, so Pokemon like Ferrothorn, Iron Treads, and Landorus-T are useful.",
    "target": "由于卡璞 · 鸣鸣通常被看作是一个纯粹的开场地手和轮转手，它可以携带讲究眼镜打得对手措手不及，能吸引土地云-灵兽和天蝎王等地面属性的宝可梦换入，并用觉醒力量[冰]重创它们。一旦地面属性的宝可梦被打倒，卡璞 ·鸣鸣便可以开始随意使用伏特替换来压制对手，造成消耗以便于如铁武者等队友清场。此外，它的高速度和电气制造者特性使它能够作为一个轮转来激活前面提到的铁武者和铁毒蛾等宝可梦的夸克充能。魔法闪耀是一个次要的属性一致招式，当使用觉醒力量[冰]有风险时，它可以作为一个折中选项来打击地面属性的宝可梦，而且它对超级拉帝亚斯和藏玛然特等对手的伤害也比其它招式更高。太晶电让卡璞 · 鸣鸣在打倒免疫电属性的对手后可以使用十万伏特清场，但卡璞 · 鸣鸣仍应主要负责触发铁武者和铁头壳等队友的特性，因此通常不应该浪费太晶化。讲究眼镜卡璞 · 鸣鸣的队友最好能因土地云-灵兽和天蝎王被击败而获益。例如，铁头壳可以更容易地强化，并且不用担心地震；铁毒蛾难以处理天蝎王，且受益于天蝎王的缺失以及电气场地；摔角鹰人因为没有了它最大的check成为了一个可怕的清场手；剑舞铁武者在没有土地云-灵兽阻挡的情况下变得非常强大。有一些盾牌宝可梦，如伽勒尔呆呆王和坚果哑铃，可以轻松阻止卡璞 · 鸣鸣；因此，能够威胁到这些敌人的队友是很有帮助的，如玛狃拉和铁毒蛾。最后，入场陷阱伤害有助于将天蝎王削弱到觉醒力量[冰]的KO范围，所以像坚果哑铃、铁辙迹和土地云-灵兽这样的宝可梦作为队友是很有帮助的。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]