[
  {
    "source": "A fantastic Speed tier, a diverse movepool, and Regenerator allow Tornadus-T to be one of the tier's defining pivots, switching into various fixtures such as Zamazenta, Landorus-T, and Ferrothorn. Knock Off complements its STAB Hurricane exceptionally well, denting Flying-resistant Pokemon such as Zapdos and Heatran as well as other bulky pivots such as Galarian Slowking and Toxapex, opening them up to entry hazard chip damage. Tornadus-T is an excellent Defogger, with positive matchups against popular entry hazard setters such as Landorus-T, Ferrothorn, and Ting-Lu. If these talents are not needed, it can use alternative options like Heat Wave to shatter Mega Scizor and Ferrothorn while preventing Mega Mawile and Corviknight from switching in freely and Toxic to hinder the likes of Tapu Koko and Raging Bolt. U-turn allows Tornadus-T to generate momentum by bringing in wallbreaking teammates such as Tapu Lele and Weavile against passive Pokemon like Toxapex and Galarian Slowking, whereas Taunt suppresses these Pokemon by denying them opportunities to heal while crucially preventing Spikes Gliscor from beating Tornadus one-on-one with Toxic. Flyinium Z bypasses Hurricane's shaky accuracy and provides a useful damage boost to take out the likes of weakened Toxapex, Gliscor, and Landorus-T. Alternatively, Heavy-Duty Boots maximizes Tornadus-T's longevity and capability to use Defog. An EV spread of 184 HP / 108 Def / 216 Spe pairs with the Z-Move to survive Zamazenta's Stone Edge after Stealth Rock while outspeeding Iron Valiant. Alternatively, 244 HP / 48 SpD / 216 Spe should be used on Heavy-Duty Boots sets to survive Iron Valiant's Choice Specs Tera Fairy Moonblast. On Heavy-Duty Boots sets, Tera Steel improves Tornadus-T's matchup against Tapu Lele and Mega Scizor and gives it an immunity to Toxic, which can aid it against Toxapex and Alomomola, whereas Tera Grass lets it keep its natural resistance to Ground and Grass while giving it resistances to Electric and Water to aid against Rotom-W and Ogerpon-W. Tornadus-T pairs fantastically with other Regenerator pivots such as Toxapex, Alomomola, and Galarian Slowking, as they form a double Regenerator core with it while pivoting into faster Pokemon that threaten it such as Mega Lopunny, Weavile, and Choice Scarf Tapu Lele. In return, Tornadus-T checks Ground- and Grass-types such as Landorus-T, Gliscor, and Kartana. Sturdy defensive stalwarts such as Ferrothorn and Gliscor help against Pokemon Tornadus-T fails to check, such as Tapu Lele, Mega Diancie, and Heatran. Offensive Pokemon such as Mega Mawile, Weavile, and Tapu Lele use Tornadus-T's tendency to force in the likes of Galarian Slowking and Zapdos to find opportunities to wallbreak effectively while appreciating its consistent entry hazard removal keeping them in good condition. Tornadus-T appreciates having solid switch-ins to Mega Tyranitar and Weavile such as Zamazenta and Iron Valiant, which can enter the field on attempts to Pursuit trap Tornadus-T.\n[SET]\nNasty Plot (Tornadus-Therian) (M) @ Flyinium Z / Heavy-Duty Boots\nAbility: Regenerator\nTera Type: Flying\nEVs: 4 HP / 252 SpA / 252 Spe\nTimid Nature\nIVs: 0 Atk\n- Nasty Plot\n- Hurricane / Bleakwind Storm\n- Focus Blast / Heat Wave\n- Taunt / Knock Off\n[SET COMMENTS]\nWith a Nasty Plot set, Tornadus-T becomes excellent against bulkier teams that lack speed control able to consistently outpace it and have a relative lack of offensive pressure, allowing it to regain its health with Regenerator to consistently wallbreak. Bleakwind Storm is an alternative to Hurricane to be more consistent with its higher accuracy, although it lacks Hurricane's power and confusion chance to properly disrupt defensive teams. Hurricane should be paired with Flyinium Z to bypass its poor accuracy with a stronger Z-Move compared to Bleakwind Storm. Focus Blast covers Mega Tyranitar, Garganacl, and Heatran, whereas Heat Wave stings Ferrothorn and Mega Scizor consistently but makes Tornadus-T completely helpless against Mega Tyranitar's Pursuit trapping. Taunt bypasses defensive counterplay such as Gliscor's Toxic, Clefable's Thunder Wave, and Ferrothorn's Leech Seed, whereas Knock Off allows Tornadus-T to wear down checks such as Rotom-W, Galarian Slowking, and Zapdos alongside entry hazard support, although a potential Static paralysis from Zapdos ruins it. Defog is an option for Tornadus-T to double as a balance-breaker and entry hazard remover with positive matchups against the likes of Landorus-T and Ferrothorn. Flyinium Z turns Hurricane into a devastating nuke without its poor accuracy to OHKO the likes of Galarian Slowking, Toxapex, and Mega Latias after a boost, whereas Heavy-Duty Boots grants Tornadus-T greater longevity to consistently pivot into the likes of Toxapex's Scald, Ferrothorn's Power Whip, and Clefable's Moonblast while using Regenerator to maintain health and PP stall these attacks when Stealth Rock is present. Tera Flying on Heavy-Duty Boots sets powers up Bleakwind Storm to OHKO Gliscor after a boost. 4 HP EVs maximize Tornadus-T's recovery from Regenerator. Tornadus-T can be a fantastic wincon on balance and bulky balance teams using Spikes, as many of its checks such as Heatran and Ting-Lu are hindered by Spikes, it can outlast these checks due to its fantastic passive longevity. As such, defensive Spikes users such as Gliscor, Ferrothorn, and Skarmory pair fantastically with Tornadus-T to aid it while also checking faster revenge killers such as Mega Lopunny and Choice Scarf Tapu Lele. Other defensive staples such as Toxapex, Alomomola, and Clefable prevent other revenge killers such as Weavile, Zamazenta, and Darkrai from using Tornadus-T as an entry point to wallbreak while generally matching up positively against offense teams with Toxic Spikes, keeping Tornadus-T's teammates healthy with Wish, and supporting it with Thunder Wave, respectively. In return, Tornadus-T rips open popular defensive cores involving opposing Toxapex and Gliscor that they fail to make progress against. Other bulky progress makers such as Mega Latias and Swords Dance Gliscor make for a good pairing with Tornadus-T, as one can weaken or impair the likes of Galarian Slowking, Ferrothorn, and Zapdos for the other to wallbreak.",
    "target": "极好的速度、多样的招式池和再生力特性使龙卷云-灵兽成为该分级的典型的轮转之一，它可以换入许多常见的宝可梦，如藏玛然特、土地云-灵兽和坚果哑铃。拍落和龙卷云-灵兽属性一致招式暴风极好地互补，能削弱闪电鸟和席多蓝恩等抵抗飞行属性的宝可梦以及伽勒尔呆呆王和超坏星等盾牌，使它们会被钉子消耗。龙卷云-灵兽是一位出色的清除浓雾使用者，在面对流行的撒钉手，如土地云-灵兽、坚果哑铃和古鼎鹿等宝可梦时能够占优势。如果不需要这些能力，它可以选择其他配置，如携带热风来打败超级巨钳螳螂和坚果哑铃，同时防止超级大嘴娃和钢铠鸦随意换入，或是使用剧毒来骚扰卡璞 · 鸣鸣和猛雷鼓等宝可梦。龙卷云-灵兽能面对超坏星和伽勒尔呆呆王等被动的宝可梦使用急速折返赚取节奏，从而让卡璞 · 蝶蝶和玛狃拉等破盾手队友上场，而挑衅则通过阻止回复来压制它们，同时关键地防止撒菱天蝎王用剧毒一对一击败龙卷云-灵兽。飞行Z弥补了暴风不稳定的命中率，且可以有效提升伤害来打败被削弱的超坏星、天蝎王和土地云-灵兽。或者，厚底靴可以最大化龙卷云-灵兽的续航能力和使用清除浓雾的能力。携带Z招式选用184HP/108防御/216速度的努力值分配，能在踩隐形岩后吃下藏玛然特的尖石攻击，同时超速铁武者。或者，244HP/48特防/216速度努力值分配适用于厚底靴配置能吃下太晶妖精后讲究眼镜铁武者的月亮之力。厚底靴配置中，太晶钢改善了龙卷云-灵兽与卡璞 · 蝶蝶和超级巨钳螳螂的对位，并让它免疫剧毒，这有助于它对付超坏星和保姆曼波，而太晶草让它保留了原本对地面和草的抗性，同时让它获得对电属性和水属性的抗性，以帮助它对抗洛托姆-清洗和厄诡椪-水井面具。龙卷云-灵兽与其他有再生力特性的中转宝可梦，如超坏星、保姆曼波和伽勒尔呆呆王配合完美，因为它们形成了一个双再生力核心，同时可以轮转威胁龙卷云-灵兽的速度更快的宝可梦，如超级长耳兔、玛狃拉和讲究围巾卡璞 · 蝶蝶。作为回报，龙卷云-灵兽能check地面和草属性宝可梦，如土地云-灵兽、天蝎王和纸御剑。如坚果哑铃和天蝎王等可靠的盾牌有助于龙卷云-灵兽对抗其难以check的宝可梦，如卡璞 · 蝶蝶、超级蒂安希和席多蓝恩。龙卷云-灵兽能迫使伽勒尔呆呆王和闪电鸟等宝可梦换入，这给了超级大嘴娃、玛狃拉和卡璞 · 蝶蝶等攻向宝可梦高效破盾的机会，同时欣赏其能稳定扫钉来帮它们保持健康。龙卷云-灵兽很欣赏能稳定地换入超级班基拉斯和玛狃拉的宝可梦，如藏玛然特和铁武者，它们可以在对手试图追打龙卷云-灵兽时上场。\n[SET]\nNasty Plot (Tornadus-Therian) (M) @ Flyinium Z / Heavy-Duty Boots\nTimid Nature\nIVs: 0 Atk\n- Hurricane / Bleakwind Storm\n- Focus Blast / Heat Wave\n- Taunt / Knock Off\n[SET COMMENTS]\n携带诡计的配置，龙卷云-灵兽在对付那些缺乏控速手段以至于无法稳定超速它、相对缺乏进攻压力的受队时非常出色，它能通过再生力特性在破盾过程中持续回复。枯叶风暴比起暴风命中率更高，但是它缺乏暴风的力度和打出混乱骚扰受队的能力。暴风应该配合飞行Z，以弥补其命中率较低的不足，与枯叶风暴相比，它具有更强的Z招式威力。真气弹能够打击超级班基拉斯、盐石巨灵和席多蓝恩，而热风能稳定打击坚果哑铃和超级巨钳螳螂，但这样会使龙卷云-灵兽完全无力对抗超级班基拉斯的追打。挑衅能防止盾牌反击，如天蝎王的剧毒、皮可西的电磁波和坚果哑铃的寄生种子，而拍落使龙卷云-灵兽能配合钉子消耗洛托姆-清洗、伽勒尔呆呆王和闪电鸟等check，不过闪电鸟潜在的静电麻痹效果会破坏这一策略。龙卷云-灵兽可以选择携带清除浓雾来兼作平衡队破坏者和面对土地云-灵兽和坚果哑铃等宝可梦占优势的清钉手。飞行Z将暴风变成了满命中的毁灭性招式，在强化一次后能OHKO伽勒尔呆呆王、超坏星和超级拉帝亚斯，而厚底靴则赋予龙卷云-灵兽更强的续航能力，使其能够持续轮转超坏星的热水、坚果哑铃的强力鞭打和皮可西的月亮之力，同时用再生力来保持血量健康，并在隐形岩存在时消耗这些招式的PP。携带厚底靴的配置可以使用太晶飞行来强化枯叶风暴，能在一次诡计后OHKO天蝎王。4HP的努力值最大化了龙卷云-灵兽再生力的回复。龙卷云-灵兽可以在平衡队和使用撒菱的平衡受中发挥出色的作用，因为它的许多check都会被撒菱消耗，如席多蓝恩和古鼎鹿，而它由于出色的被动续航能力，可以在持久战中胜出。因此，天蝎王、坚果哑铃和盔甲鸟等防御型撒菱使用者与龙卷云-灵兽配合很好，同时也能check超级长耳兔和讲究围巾卡璞 · 蝶蝶等更快的复仇杀手。其他盾牌，如超坏星、保姆曼波和皮可西，可以防止玛狃拉、藏玛然特和达克莱伊等其他复仇杀手把龙卷云-灵兽当作破盾的切入点，同时超坏星能面对使用毒菱的攻队占优势，保姆曼波可以用祈愿保持龙卷云-灵兽队友的血量健康 ，皮可西能用电磁波辅助它。作为回报，龙卷云-灵兽能撕开常见的联防，包括其他盾牌无法处理的对手的超坏星和天蝎王。其他耐久破受者，如超级拉帝亚斯和剑舞天蝎王，能很好地配合龙卷云-灵兽，因为它们可以一同消耗突破伽勒尔呆呆王、坚果哑铃和闪电鸟等宝可梦。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]