[
  {
    "source": "With an astonishingly high Attack stat and access to Swords Dance, Mega Garchomp serves as a decent wallbreaker that is capable of breaking common defensive staples and setting up in front of the likes of Toxapex, Galarian Slowking, Heatran, and Zapdos. Scale Shot lets it break Dragonite's Multiscale as well as Substitute from the likes of Kyurem and Serperior, and it can patch up its mediocre base Speed and outspeed them at +1. Fire Fang hits Skarmory and Corviknight and also OHKOes Mega Scizor and Ferrothorn at +2. Mega Garchomp appreciates teammates like Tornadus-T, Zapdos, and Landorus-T, since they can pivot and give it safe entry into foes like Toxapex and Heatran and let it take advantage of the switches it forces in order to set up Swords Dance. Dual screens support from Tapu Koko and Grimmsnarl gives it opportunities to set up. Fairy-type Pokemon like Iron Valiant and Tapu Lele appreciate Mega Garchomp's ability to lure and weaken Steel-types like Ferrothorn, Mega Scizor, and Corviknight. Teammates like Alomomola, Galarian Slowking, and Volcarona can cover Garchomp's Ice and Fairy weaknesses from foes like Weavile and Iron Valiant. Physical walls like Dondozo and Landorus-T make it difficult for Mega Garchomp to sweep, so physical wallbreakers such as Ogerpon-W, Hawlucha, and Iron Boulder are good teammates. Tapu Lele's Psychic Terrain prevents priority attacks that try to stop Mega Garchomp from sweeping, such as Weavile's Ice Shard and Mega Lopunny's Fake Out. Additionally, Tapu Koko prevents Dondozo from using Rest, as it summons Electric Terrain. Offensive teammates such as Choice Scarf Kartana and Mega Scizor can check foes that try to revenge kill Mega Garchomp like Choice Scarf Tapu Lele, Urshifu-R, and Booster Energy Iron Valiant.",
    "target": "凭借惊人的高攻击种族值和剑舞，超级烈咬陆鲨成为了一个优秀的破盾手，可以突破常见的盾牌，并能在超坏星、伽勒尔呆呆王、席多蓝恩和闪电鸟等宝可梦面前进行强化。鳞射可以让它打破快龙的多重鳞片以及酋雷姆和君主蛇等宝可梦的替身，也可以弥补其平庸的速度种族值，在速度+1后超速它们。火焰牙能够打击盔甲鸟和钢铠鸦，且在攻击+2后能OHKO超级巨钳螳螂和坚果哑铃。超级烈咬陆鲨很欣赏龙卷云-灵兽、闪电鸟和土地云-灵兽这样的队友，因为它们可以提供中转来让它安全地对超坏星和席多蓝恩等的对手换入，并利用对手被逼退的机会使用剑舞强化。卡璞 · 鸣鸣和长毛巨魔的双墙辅助可以为其提供更多的强化机会。铁武者和卡璞 · 蝶蝶等妖精属性的宝可梦欣赏超级烈咬陆鲨吸引和削弱像坚果哑铃、超级巨钳螳螂和钢铠鸦等钢属性宝可梦的能力。像保姆曼波、伽勒尔呆呆王和火神蛾等队友可以打击玛狃拉和铁武者等可以靠冰与妖精属性克制超级烈咬陆鲨的对手。因为吃吼霸和土地云-灵兽这样的物盾让超级烈咬陆鲨很难清场，所以厄诡椪-水井面具、摔角鹰人和铁磐岩这样的物攻破盾手是很好的队友。卡璞 · 蝶蝶的精神场地能防止试图阻止超级烈咬陆鲨清场的先制招式，如玛狃拉的冰砾和超级长耳兔的击掌奇袭。此外，卡璞 · 鸣鸣能开出电气场地来阻止吃吼霸使用睡觉。攻向队友，如讲究围巾纸御剑和超级巨钳螳螂，可以check试图复仇杀超级烈咬陆鲨的敌人，如讲究围巾卡璞 · 蝶蝶、武道熊师-连击流和驱劲能量铁武者。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]