[
  {
    "source": "Choice Scarf Landorus-T functions as an excellent late-game cleaner and revenge killer, due to its ability to outspeed Pokemon such as Tapu Koko and Mega Diancie and threaten important defensive pieces such as Heatran, Gholdengo, and Kingambit with Earthquake. It can also leverage its excellent defensive typing and Intimidate to perform as a switch-in to Garchomp, Dragonite, and opposing Landorus-T. Stone Edge hits Flying-types such as Zapdos, Mega Charizard Y, and Moltres, OHKOing the latter two. Defog allows Landorus-T to capitalize on forced switches by removing entry hazards, while Explosion allows it to deal large damage to Pokemon such as Ogerpon-W and Rotom-W and gain momentum when at low HP. 8 HP EVs allow Landorus-T to switch in on Stealth Rock one extra time.\nLandorus-T largely fits on bulky offense teams, where its high Speed and ability to threaten common defensive pieces such as Gholdengo and Kingambit are appreciated. However, Landorus-T struggles to break Flying-types such as opposing Landorus-T, Gliscor, and Zapdos. This means teammates that can break these such as Kyurem and Weavile are appreciated; in return, Landorus-T breaks Steel-types such as Kingambit and Melmetal for them and can bring them in safely via U-turn. Landorus-T also finds it difficult to break through common defensive pieces such as Ferrothorn and Ting-Lu, meaning Fighting-types that beat them such as Zamazenta, Urshifu-R, and Mega Lopunny are all appreciated. In return, Landorus-T breaks through Toxapex and revenge kills Tapu Koko and Mega Diancie for them. Landorus-T finds itself vulnerable to Water-types such as Choice Scarf Urshifu-R, as well as rain sweepers such as Mega Swampert and Barraskewda. This means switch-ins such as Mega Latios and Ferrothorn are enjoyed, with Landorus-T breaking Steel-types and Mega Tyranitar for the former. Landorus-T also struggles with strong priority from Pokemon such as Weavile, meaning teammates such as Tapu Lele are appreciated, with Landorus-T breaking Steel- and Poison-types for it and allowing it to use Moonblast more freely.",
    "target": "围巾土地云-灵兽凭借其速度优势，能超速卡璞·鸣鸣和超级蒂安希等宝可梦，成为出色的清场手与复仇杀手。地震可以威胁席多蓝恩、赛富豪和仆刀将军等关键防御宝可梦。其优秀的防御属性与威吓特性，也使其能换挡烈咬陆鲨、快龙及同类土地云-灵兽。尖石攻击针对飞行属性宝可梦，如闪电鸟、超级喷火龙Y与火焰鸟，并能OHKO后两者。清除浓雾可在迫使对手换下时清除场地伤害，而大爆炸则能重创厄诡椪-水井面具和洛托姆-清洗等目标，并在残血时赚取节奏。8点HP努力值确保土地云能多承受一次隐形岩的伤害。\n土地云-灵兽主要适用于平衡攻队，凭借高速与压制赛富豪和仆刀将军等常见防御核心的能力成为队伍的重要成员。然而它难以处理同类土地云-灵兽、天蝎王和闪电鸟等飞行属性宝可梦，因此需要搭配酋雷姆和玛狃拉等能突破这些对手的队友。作为回报，土地云-灵兽能为其突破仆刀将军和美录梅塔等钢属性对手，并通过急速折返带它们安全上场。 土地云-灵兽也难以处理坚果哑铃和古鼎鹿等常见盾牌。此时藏玛然特、武道熊师-连击流和超级长耳兔等格斗属性队友便显得尤为重要。而土地云则会为它们解决超坏星，并复仇杀卡璞·鸣鸣和超级蒂安希。 围巾武道熊师-连击流这类水属性进攻手，以及超级巨沼怪和戽斗尖梭等雨天打手都极大地威胁到了土地云-灵兽，因此需要超级拉帝欧斯、坚果哑铃等宝可梦进行联防。土地云将为前者突破钢属性宝可梦与超级班基拉斯。此外，玛狃拉等宝可梦的强力先制招式也会让土地云-灵兽陷入被动，此时搭配卡璞·蝶蝶将是不错的选择，而土地云-灵兽可以通过清除钢属性与毒属性宝可梦，使卡璞·蝶蝶能够更自如地使用月亮之力。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]