[
  {
    "source": "Swords Dance Ogerpon-W is an incredibly dangerous wallbreaker and sweeper thanks to its ability to take advantage of defensive staples like Alomomola and Ting-Lu, the power boost from Wellspring Mask, and its good Speed tier. Swords Dance amps up Ogerpon-W's power to dangerous levels, most notably OHKOing standard Ferrothorn with Superpower and 2HKOing defensive Zapdos and Toxapex with Ivy Cudgel and Power Whip, respectively. Power Whip is a more threatening STAB option thanks to its high Base Power, but Horn Leech lets Ogerpon-W offset any Toxic damage from Toxapex and Alomomola, letting it set up on the pair. Superpower hits Steel-types like Ferrothorn and Archaludon, OHKOing them at +2. Alternatively, Encore lets Ogerpon-W gain setup opportunities against passive foes like Ferrothorn and Toxapex using status moves. With Tera Water, Ogerpon-W not only gets a huge boost to Ivy Cudgel's power, but also gains a Special Defense boost, which can help stave off revenge killing attempts from threats like Tornadus-T and Iron Valiant. Ogerpon-W can struggle with Grass-types like Kartana and Ferrothorn, especially if lacking Superpower, so teammates like Heatran and Tornadus-T are greatly appreciated. Heatran also sets Stealth Rock to help Ogerpon-W defeat its answers that lack recovery, like Raging Bolt and Archaludon if Ogerpon-W lacks Superpower, over a longer period of time if it cannot brute-force its way through them. Tornadus-T, meanwhile, can remove entry hazards to improve Ogerpon-W's longevity as well as remove crucial items like Leftovers from defensive stops like Toxapex and Raging Bolt. Its Nasty Plot set also appreciates Ogerpon-W's ability to take advantage of specially defensive walls like Ting-Lu and Chansey. Offensive teammates like Tapu Lele, Iron Valiant, Weavile, and Mega Tyranitar can deal with Dragon-types like the aforementioned Raging Bolt and Dragonite; Weavile and Mega Tyranitar in particular can Pursuit trap said Dragon-types, opening Ogerpon-W up to sweeping. Despite having a good Speed tier, Ogerpon-W is vulnerable to being revenge killed by faster threats like Iron Boulder and Mega Lopunny; as such, teammates that can switch into these threats, like Landorus-T and Gliscor, are highly appreciated. Additionally, teammates that offensively pressure these revenge killers, like Zamazenta and Great Tusk, are good choices to pair with Ogerpon-W.",
    "target": "剑舞厄诡椪-水井面具是极为恐怖的破盾手和清场手，这多亏了它对保姆曼波和古鼎鹿等常见盾牌的压制力、水井面具带来的火力提升和优秀的速度。剑舞将厄诡椪-水井面具的力度提升到了夸张的水平，使得蛮力能OHKO常规配置的坚果哑铃，棘藤棒可以2HKO物耐闪电鸟，强力鞭打能OHKO物耐超坏星。由于更高的基础威力，强力鞭打作为属性一致招式威胁更大，但是木角可以帮厄诡椪-水井面具抵消来自超坏星和保姆曼波的剧毒伤害，使其能够对着它们强化。蛮力能打击坚果哑铃和铝钢桥龙等钢属性宝可梦，并在攻击+2时OHKO它们。再来一次则能够让厄诡椪-水井面具在坚果哑铃和超坏星等宝可梦使用状态招式时获得机会强化。太晶水不仅巨幅提高了厄诡椪-水井面具棘藤棒的威力，还让它获得了一段特防提升，让它得以化解来自龙卷云-灵兽和铁武者等威胁的复仇杀。没有携带蛮力时，厄诡椪-水井面具不好处理纸御剑和坚果哑铃等草属性宝可梦，因此席多蓝恩和龙卷云-灵兽等队友对它帮助很大。席多蓝恩还能撒下隐形岩来帮助厄诡椪-水井面具对付它缺少回复的check，比如猛雷鼓和铝钢桥龙，即使厄诡椪-水井面具没有携带蛮力，它也能在多次消耗后强行突破这些对策。同时，龙卷云-灵兽可以通过扫钉保障厄诡椪-水井面具的续航能力，还能移除超坏星和猛雷鼓等耐久向check身上重要的道具，比如吃剩的东西。诡计龙卷云-灵兽还能从厄诡椪-水井面具压制古鼎鹿和吉利蛋等特盾的能力中获益。卡璞・蝶蝶、铁武者、玛狃拉和超级班基拉斯等攻向队友可以处理快龙和前文提及的猛雷鼓等龙属性宝可梦；玛狃拉和超级班基拉斯还能使用追打抓捕这些龙属性宝可梦，给厄诡椪-水井面具清场开路。尽管厄诡椪-水井面具速度不错，它还是很容易被铁磐岩和超级长耳兔等更快的对手复仇杀，因此，土地云-灵兽和天蝎王等能换入它们的队友非常关键。此外，藏玛然特和雄伟牙等队友能通过进攻给这些复仇杀手施加压力，这让它们也成了厄诡椪-水井面具理想的队友。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]