[
  {
    "source": "Tornadus-T is an effective pivot due to Regenerator, a Speed tier higher than threats such as Iron Valiant and Ogerpon-W, and its ability to effectively switch into Pokemon like Great Tusk and Kartana. Bleakwind Storm is preferred for higher accuracy, but Hurricane, especially when used with Flyinium Z, can be used for the extra power boost; even without the Z boost, it guarantees the OHKO on Ogerpon-W after Stealth Rock. Knock Off is vital to remove items such as Leftovers and Heavy-Duty Boots from Pokemon like Clefable, Heatran, and Toxapex, hindering their longevity. Heat Wave hits Gholdengo, Ferrothorn, and Mega Scizor. Defog is a potential option if a team does not have another form of entry hazard removal, especially since Tornadus-T has decent matchups against hazard setters such as Landorus-T and Great Tusk. However, losing the coverage to hit the aforementioned Steel-types is less than ideal. Heavy-Duty Boots allows Tornadus-T to gain Regenerator recovery even in the face of Stealth Rock; however, Flyinium Z can also be used to make attempts at revenge killing foes like unboosted Roaring Moon, Garchomp, and Mega Charizard Y more efficient. The given EVs help Tornadus-T survive a Stone Edge from Zamazenta after Stealth Rock and outspeed Iron Valiant.\nTornadus-T fits on balance and bulky offense teams where its high Speed and vast amount of utility options are appreciated. Pokemon like Slowbro and Gholdengo appreciate Tornadus-T's ability to switch in on Grass- and Ground-types such as Landorus-T and Ogerpon-W, with the former also creating a Regenerator core that allows the pair to switch back and forth effortlessly against passive foes such as Toxapex and Gliscor. Wallbreakers such as Ogerpon-W and Tapu Lele take advantage of Tornadus-T's ability to pivot on defensive pieces these wallbreakers prey on, such as Gliscor and Toxapex. Electric-types such as Zapdos, Tapu Koko, and Raging Bolt are problematic for Tornadus-T, as they prevent it from gaining momentum easily, so checks to these Pokemon like Gliscor, Heatran, and Ting-Lu are all stellar partners. In return, Tornadus-T can ease matchups against foes like Great Tusk, Landorus-T, and Ogerpon-W. Tornadus-T can struggle to force progress against Steel-types such as Kingambit, Gholdengo, and Heatran, so teammates that can take advantage of Tornadus-T pivoting on them such as Urshifu-R and Garchomp are appreciated.",
    "target": "龙卷云-灵兽凭借再生力特性成为高效的轮转核心，其速度线高于铁武者和厄诡椪-水井面具等威胁，能换挡雄伟牙与纸御剑等宝可梦‌。枯叶风暴因命中率更高而被优先选用，但暴风可借助额外威力加成发挥作用，尤其是配合飞行Z时；即使不使用Z招式，隐形岩存在时暴风也能确保OHKO厄诡椪-水井‌面具。拍落能移除皮可西、席多蓝恩和超坏星等宝可梦的吃剩的东西与厚底靴等关键道具，可削弱它们的续航能力。热风用于打击赛富豪、坚果哑铃与超级巨钳螳螂。若队伍缺乏其他除钉手段，清除浓雾可作为备选方案，因龙卷云-灵兽形在对抗土地云-灵兽和雄伟牙等撒钉手时很有优势，但放弃针对上述钢属性宝可梦的打击面并非理想选择‌。厚底靴使龙卷云-灵兽形态即使面对隐形岩也能通过再生力恢复HP，而飞行Z可以复仇杀未强化的轰鸣月、烈咬陆鲨和超级喷火龙Y等对手。这个配置的努力值帮助龙卷云-灵兽在隐形岩伤害后也能承受藏玛然特的尖石攻击，并确保快过铁武者‌。\n龙卷云-灵兽适配于平衡队与平衡攻队中，其高速度与丰富的功能性招式组合备受青睐。像呆壳兽和赛富豪这类宝可梦会受益于龙卷云-灵兽换挡如土地云-灵兽形态和厄诡椪-水井面具等地面属性与草属性宝可梦的能力。其中，呆壳兽还能与龙卷云形成再生力轮转核心，使二者在面对诸如超坏星与天蝎王等被动型对手时能够轻松轮换。 破盾手如厄诡椪-水井面具和卡璞·蝶蝶可借助龙卷云的轮转对天蝎王、超坏星等防御盾牌换入，以压制它们。电属性宝可梦如闪电鸟、卡璞·鸣鸣与猛雷鼓会对龙卷云-灵兽造成威胁，很容易地阻碍龙卷云-灵兽掌控节奏，因此需搭配如天蝎王、席多蓝恩与古鼎鹿等能够check这些电属性宝可梦的队友。作为回报，龙卷云可帮助应对如雄伟牙、土地云-灵兽与厄诡椪-水井面具等对手。龙卷云-灵兽难以突破如仆刀将军、赛富豪与席多蓝恩等钢属性宝可梦，因此需要如武道熊师-连击流与烈咬陆鲨等队友利用其轮转能力换入以压制钢属性宝可梦。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]