[
  {
    "source": "Zapdos is a key defensive piece on teams due to its typing and bulk, letting it handle Pokemon like Great Tusk, Urshifu-R, and Zamazenta, crippling them with Static for its teammates. Heat Wave allows Zapdos to deal meaningful damage to Pokemon that would usually come in against it, like Gholdengo and Ferrothorn, as well as letting it become a stopgap for Kingambit. Defog allows it to remove entry hazards for its teammates as well as itself if loses its Heavy-Duty Boots, as it has a good matchup against common hazard setters like Ferrothorn and Landorus-T. Hidden Power Ice allows it to get a surprise 2HKO on Gliscor, as well as giving Zapdos a more reliable option against Garchomp and Landorus-T.\nZapdos can easily be slot in on a defensive backbone on bulky offense and balance teams looking for a solid defensive pivot, since it is able to easily take a hit and bring in its teammates. Pokemon like Mega Medicham and Kingambit can also take advantage of the paralysis that Zapdos spreads to outspeed Pokemon like Zamazenta and Iron Valiant that would otherwise threaten them. Kingambit in particular can threaten Pokemon like Gholdengo, Mega Latios, and Weavile that would normally force Zapdos out while also trapping Pokemon like Gholdengo and Galarian Slowking, while Zapdos can chip down Fighting-types like Great Tusk and Zamazenta, which would normally stop a Kingambit sweep. Pokemon like Ogerpon-W and Weavile also appreciate Zapdos bringing them in on Pokemon like Heatran and Raging Bolt, respectively, while also eliminating Ground-types like Garchomp, Gliscor, and Ting-Lu so that Zapdos can keep on pivoting without worrying about Volt Switch being blocked. Knock Off users like the aforementioned Weavile as well as Gliscor, Mega Tyranitar, and Kingambit can also prove annoying for Zapdos, as they can remove its Heavy-Duty Boots, forcing it to take Stealth Rock damage and get chipped down over the course of the game, so Pokemon that can deal with these foes, like Zamazenta and Urshifu-R, or Pokemon that can absorb Knock Off from these Pokemon for Zapdos, like Mega Tyranitar and your own Gliscor, can go a long way in keeping Zapdos healthy. Great Tusk in particular can remove hazards for Zapdos should its Heavy-Duty Boots get removed by Knock Off, so it can still switch into Great Tusk's checks for it like Urshifu-R and Alomomola without getting chipped down.",
    "target": "闪电鸟凭借其属性组合与耐久成为队伍中关键的防御成员，能够有效应对雄伟牙、武道熊师-连击流和藏玛然特等宝可梦，并通过静电特性削弱它们并为队友创造机会。热风使闪电鸟能对经常试图换挡的赛富豪和坚果哑铃等宝可梦造成可观伤害，同时也能抵挡仆刀将军的进攻。它在对位坚果哑铃、土地云-灵兽等常见撒钉手时占据优势，因而能携带清除浓雾来帮助队友或者失去厚底靴的自身扫除场地伤害。觉醒力量-冰则能出其不意地2HKO天蝎王，并为打击烈咬陆鲨和土地云-灵兽提供更可靠的手段。\n闪电鸟能轻松融入需要坚固中转的平衡攻和平衡队，成为可靠的防守核心。它既能承受对手攻击，又能安全轮转队友上场。超级恰雷姆和仆刀将军等宝可梦也能利用闪电鸟散布的麻痹状态，超速原本快过它们的藏玛然特和铁武者等对手。尤其是仆刀将军，能有效威胁赛富豪、超级拉帝欧斯和玛狃拉这些通常能逼退闪电鸟的对手，同时还能捕获赛富豪和伽勒尔呆呆王。而闪电鸟则能削弱雄伟牙和藏玛然特等阻碍仆刀将军清场的格斗属性宝可梦。厄诡椪-水井面具和玛狃拉也青睐闪电鸟的轮转能力，前者可借此压制席多蓝恩，后者能打击猛雷鼓。它们还能清除烈咬陆鲨、天蝎王和古鼎鹿等地面属性宝可梦，确保伏特替换不被拦截。然而玛狃拉、天蝎王、超级班基拉斯和仆刀将军等拍落使用者会严重干扰闪电鸟，它们拍掉其重要的厚底靴后，闪电鸟将持续受隐形岩消耗。因此搭配能处理这些拍落使用者的藏玛然特和武道熊师-连击流，或是能主动替闪电鸟承受拍落的超级班基拉斯、己方天蝎王等队友，能大幅提升闪电鸟的续航能力。雄伟牙还能在闪电鸟失去厚底靴后为其清除场地伤害，使其能继续换挡武道熊师-连击流和保姆曼波等雄伟牙的check而不被消耗。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]