[
  {
    "source": "Swords Dance Gliscor is the most potent and efficient wincon in the tier, able to outlast almost all of its checks, courtesy of its its immense bulk and its ability Poison Heal, which grants it status immunity, passive recovery, and the ability to not worry about Knock Off crippling it. These traits also allow it to check and freely set up on a myriad of Pokemon such as Toxapex, Heatran, and Mega Diancie. Facade complements Earthquake, giving Gliscor near perfect coverage, and its high PP also lets Gliscor outlast checks like Skarmory. Roost is important, as it lets Gliscor stave off stronger attacks like Tapu Koko’s Hidden Power Ice and lets Gliscor scout Choice-locked Pokemon like Tapu Lele, Iron Valiant, and Kartana. Taunt can also be used over Earthquake to deny more passive checks such as Skarmory and Ferrothorn from boosting up with Iron Defense or Leech Seeding it, as well as beat opposing Swords Dance Gliscor and Taunt Heatran if it Terastallizes. However, this comes at the cost of significant special bulk due to the need to run more Speed investment, as well as the ability to instantly threaten Heatran. Swords Dance Gliscor is a frequent Tera user, as it can often be extremely difficult to revenge kill once it has Terastallized to beat any offensive check it has. Tera Fairy gives Gliscor an all-around great defensive type, letting it take neutral damage from attacks like Kyurem’s Freeze Dry and Darkrai’s Dark Pulse while still being neutral to Water-, Grass-, and Ice-type attacks. Tera Water, on the other hand, lets Gliscor resist these Water- and Ice-type attacks, completely flipping the matchup on Pokemon like Urshifu-R and Weavile. The given EVs maximise Gliscor’s Poison Heal recovery and special bulk, with the remaining EVs in Speed, but a Jolly nature with 20 Speed EVs can be used with Taunt to outspeed max Speed Modest Heatran. Swords Dance Gliscor works best on bulkier teams with solid entry hazard support from Ferrothorn and Clefable to help pressure the switches it forces. Pokemon like Kartana, Iron Valiant, and Mega Tyranitar that can cripple or pressure its checks, such as Skarmory, Mega Latias, and Ferrothorn, are amazing partners as well. Other setup sweepers such as Iron Defense Zamazenta and Calm Mind Mega Latias also appreciate Gliscor’s ability to take advantage of Galarian Slowking and Toxapex. If Gliscor has not yet Terastallized, it can easily be forced out by Water- and Ice-type attacks from Pokemon like Weavile, Urshifu-R, and Kyurem; this makes partners like Mega Scizor, Toxapex, and Corviknight that can stave off these attacks important.\n[SET]\nname: Utility\nmove 1: Spikes / Defog / Stealth Rock\nmove 2: Toxic\nmove 3: Earthquake\nmove 4: Roost\nitem: Toxic Orb\nability: Poison Heal\nnature: Careful\ntera type: Fairy / Water\nevs: 252 HP / 4 Def / 252 SpD\n[SET COMMENTS]\nGliscor is one of the most effective entry hazard setters and Defog users in the tier due to its unparalleled longevity and bulk, letting it outlast or outright beat common hazard removers and setters such as Tornadus-T, Heatran, and Great Tusk. These attributes also provide Gliscor with numerous opportunities to switch in and either set or remove entry hazards against passive Pokemon like Toxapex, Clefable, and Landorus-T. Toxic helps with Gliscor's passiveness and puts its offensive checks like Great Tusk, Tornadus-T, and Urshifu-R on a timer, letting it outlast the former two, which seek to remove its Spikes. Roost is important for Gliscor’s durability, letting it constantly stave off attacks from Pokemon like Heatran and Mega Diancie throughout the match. Knock Off is an option over Toxic to cripple Gliscor’s switch-ins like Ferrothorn and Rotom-W, allowing it to further pressure them with Spikes. However, this does make Gliscor significantly more passive, making it generally inferior to Toxic unless desperately needed. Tera Fairy lets Gliscor pivot into Choice Specs Darkrai’s Dark Pulse in a pinch and check Raging Bolt consistently, while Tera Water lets Gliscor get off a Toxic or Earthquake on threats like Ogerpon-W and Urshifu-R to prevent them from spiraling out of control. Pokemon like Ogerpon-W, Zamazenta, and Iron Valiant appreciate Spikes chip damage helping to wear down their checks. Due to its susceptibility to strong Water- and Ice-type attacks, Toxapex, Kartana, and Mega Scizor are premier partners, which also also appreciate Gliscor checking Heatran, Mega Lopunny, and Tapu Koko.",
    "target": "剑舞天蝎王是分级中最优秀且高效的致胜点之一，能够持续消耗几乎所有的check直到打败它们，它不错的耐久和毒疗特性给予了它免疫异常状态、被动回复和不怕拍落削弱的能力。这些特点让它能check许多宝可梦，并将这些宝可梦当作起点免费强化，例如超坏星、席多蓝恩和超级蒂安希。硬撑配合地震，让天蝎王拥有几乎完美的打击面，它高额的PP也能让天蝎王有机会拖死盔甲鸟等check。羽栖是很重要的，让天蝎王能够抵御如卡璞·鸣鸣的觉醒力量-冰等强力的攻击并试探出卡璞·蝶蝶、铁武者和纸御剑等讲究道具的锁招。挑衅也可以替换地震，通过阻止对手使用铁壁提升防御和寄生种子回复来打败盔甲鸟和坚果哑铃等更被动的check，也能打败对手的剑舞天蝎王并挑衅太晶化后的席多蓝恩。尽管如此，这种配置需要以大量特殊耐久为代价，将其投入到速度努力中来投入更多的速度努力，同时也失去了立即威胁席多蓝恩的能力。剑舞天蝎王是常见的太晶化使用者，并且在太晶化后非常难被复仇杀，也能打败许多常见的攻向check。太晶妖精给予了天蝎王优秀的防御属性，让它能够承受酋雷姆的冰冻干燥和达克莱伊的恶之波动同时不被水、草和冰属性克制。而太晶水则让它能抵抗水属性和冰属性，完全扭转了对武道熊师-连击流和玛狃拉等宝可梦的对位。这种努力值分配最大化了天蝎王毒疗的回复量和特殊耐久，剩下的努力值分给速度，而挑衅的配置可以通过爽朗性格加上20点速度努力来超速满速内敛席多蓝恩。剑舞配置天蝎王在耐久队伍队伍中运转良好，在坚果哑铃和皮可西撒下的钉子支持下对换入施压。纸御剑、铁武者和超级班基拉斯等宝可梦是非常不错的队友，能削弱或施压盔甲鸟、超级拉帝亚斯和坚果哑铃等天蝎王的check。其他诸如铁壁藏玛然特和冥想超级拉帝亚斯等清场手也欣赏天蝎王能在伽勒尔呆呆王和超坏星面前取得优势的能力。如果天蝎王没有太晶化，它会被玛狃拉、武道熊师-连击流和酋雷姆的水和冰属性攻击轻易逼退；所以超级巨钳螳螂、超坏星和钢铠鸦等能承受这些攻击的队友是很重要的。\n[SET]\nname: Utility\nmove 1: Spikes / Defog / Stealth Rock\nmove 2: Toxic\nmove 3: Earthquake\nmove 4: Roost\nitem: Toxic Orb\nability: Poison Heal\nnature: Careful\ntera type: Fairy / Water\nevs: 252 HP / 4 Def / 252 SpD\n[SET COMMENTS]\n天蝎王是分级中最高效的撒钉手和清除浓雾使用者之一，它无与伦比的持久性和耐久让它能够消耗或立即打败龙卷云-灵兽、席多蓝恩和雄伟牙等常规的除钉手和撒钉手。这些特点也提供给天蝎王非常多的换入机会并借此对着超坏星、皮可西和土地云-灵兽等被动的宝可梦撒钉或清钉。剧毒帮助解决天蝎王被动的问题并让雄伟牙、龙卷云-灵兽和武道熊师-连击流等进攻向check的生命进入倒计时，从而让天蝎王能够在前二者登场清钉子的时候持续消耗它们。羽栖对天蝎王的续航非常重要，让它能够在对局中持续地挡住席多蓝恩和超级蒂安希。拍落是剧毒的一个替代选项，能够削弱坚果哑铃和清洗洛托姆等天蝎王的常规换入，并配合撒菱施加更多压力。但是携带拍落会让天蝎王变得更被动，大部分情况下不如剧毒，除非有特殊的需要。太晶妖精让天蝎王在紧要关头能中转讲究眼镜达克莱伊的恶之波动并保持check猛雷鼓，而太晶水让天蝎王能对着厄诡椪-水井面具和武道熊师-连击流等威胁使用剧毒和地震，阻止它们变得难以处理。厄诡椪-水井面具、藏玛然特和铁武者欣赏天蝎王的撒菱，这能帮助削弱它们的check。因为天蝎王害怕强力的水和冰属性攻击，所以超坏星、纸御剑和超级巨钳螳螂都是不错的队友，它们也欣赏天蝎王check席多蓝恩、超级长耳兔和卡璞·鸣鸣的能力。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]