[
  {
    "source": "Skarmory's excellent bulk giving it a favorable matchup against physical attackers and ability to wear down foes with Spikes grant it an important role on balance teams. Iron Defense + Body Press allows Skarmory to beat physical setup sweepers, like Garchomp and Iron Boulder, and potentially clean late-game. This is particularly potent due to the lack of Ghost-type Pokemon in the tier, which diminishes the common checks and counters. Furthermore, Tera Dragon allows Skarmory to win duels against Pokemon that it cannot usually handle, like Ogerpon-W and Urshifu-R, while also mitigating its vulnerabilities to Fire-type and Electric-type attacks from Pokemon like Gouging Fire without Dragon-type STAB moves\n,Fire\nPunch Ursaluna, and Iron Hands. Rocky Helmet punishes pivoting moves like U-turn from Pokemon like Landorus-T, Mega Lopunny, and Rillaboom, further weakening them over time and reinforcing Skarmory's role as a defensive stalwart and entry hazard setter. Moreover, thanks to the Rocky Helmet, Skarmory wins its duels against IronPress variants of Zamazenta. The 64 EVs in Speed allow Skarmory to outspeed threats such as Ursaluna and defensive Heatran. Skarmory emerges as an ideal choice for defensively oriented teams, capitalizing on its exceptional Defense to provide a reliable physical wall in defensive cores. Mega Tyranitar and Clefable , can set up Stealth Rock and capitalize on its entry hazard support to apply pressure to opposing teams. In return, they can remove Heavy-Duty Boots and other items with Knock Off from foes like Zamazenta and Ferrothorn. Additionally, to counterbalance Skarmory's vulnerability to special attackers such as Volcarona and Tapu Koko, pairing it with special walls like Galarian Slowking, Ting-Lu, and Heatran is essential. In return, Skarmory offers an invaluable check to Pokemon like Rillaboom and Landorus-T and applies pressure with its Spikes",
    "target": "因为盔甲鸟出色的防御，它能够轻松地联防物攻手，并且通过撒菱去不断消耗对手，这在平衡队中是相当重要的。铁壁 + 扑击的招式组合，让盔甲鸟在能够威胁烈咬陆鲨、铁磐岩这类物攻强化清场手的同时，还具有一定的残局清场能力。由于当前分级缺少幽灵属性宝可梦，所以这效果很不错，它减少了常规的check和counter。此外，太晶龙能帮助盔甲鸟战胜一些原本没法处理的宝可梦，例如厄诡椪-水井面具和武道熊师-连击流，同时避免火属性与电属性的弱点，阻挡没有携带龙属性一致招式的破空焰，火焰拳月月熊、铁臂膀。凸凸头盔可以通过吃下轮转技能蹭血，例如土地云-灵兽、超级长耳兔和轰擂金刚猩的急速折返，并且不断削弱它们的状态，强化了盔甲鸟作为队伍盾牌核心与撒钉手的作用。凭借凸凸头盔，盔甲鸟能与藏玛然特对攻。而速度拉了64点努力值的盔甲鸟可以超速月月熊、受向席多蓝恩这类宝可梦。盔甲鸟有着极高的防御，是一面非常结实的物盾，也是受队成员的理想成员之一。超级班基拉斯、皮可西可以使用隐形岩，利用钉子施加对方上场压力。它们还可以使用拍落移除藏玛然特、坚果哑铃等宝可梦的厚底鞋和其他道具。此外，盔甲鸟在面对卡璞・鸣鸣、火神蛾等特攻手时\n，\n相当脆弱，所以可以给它搭配一些特盾队友，例如伽勒尔呆呆王、古鼎鹿和席多蓝恩等。作为回报，盔甲鸟可以逼退土地云-灵兽、轰擂金刚猩这些宝可梦，并通过撒菱不断地消耗对手。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]