[
  {
    "source": "Calm Mind Clefable serves as a resilient setup sweeper, taking advantage of its bulk, excellent defensive typing, and useful abilities in Magic Guard and Unaware. Magic Guard notably provides Clefable with an extremely valuable immunity to entry hazards, in addition to negating Toxic from the likes of Gliscor and acting as a status absorber for the rest of the team, especially if it has already been poisoned. Unaware makes it a strong check to foes that rely on boosting their stats like Swords Dance Garchomp and Bulk Up Great Tusk. Calm Mind boosts allow Clefable to check additional threats like Mega Diancie, making it much less passive against most foes. Moonblast's Special Attack drop chance makes Clefable even harder to break for foes like Tapu Lele. Knock Off removes key items like Leftovers and Heavy-Duty Boots from foes that are not threatened by even boosted Moonblast, such as Toxapex, Heatran, and Volcarona. Alternatively, Flamethrower targets Steel-types, such as Mega Scizor and Gholdengo, and Thunder pressures walls like Corviknight and Toxapex while hitting Heatran for neutral damage, although its accuracy can be unreliable. Thunder is preferred over Thunderbolt thanks to its higher paralysis chance and damage, but the latter is also a viable option. Soft-Boiled is required to provide Clefable reliable and immediate recovery. Leftovers is another source of longevity, providing passive recovery for longer matchups. Life Orb enables valuable damage rolls, like 2HKOing Ting-Lu with one boosted Moonblast and OHKOing Urshifu-R with unboosted Moonblast, and additionally has no drawback thanks to Magic Guard. If Clefable's ability is Unaware, then Heavy-Duty Boots is required to protect it from Spikes and particularly Toxic Spikes, which is important for its setup sweeper role and its ability to check the opposing setup sweepers mentioned above.\nClefable fits on balance teams that appreciate its ability to set up on physical threats like non-Heavy Slam Zamazenta and act as a bulky wincon. Pokemon like Mega Tyranitar and Kingambit appreciate Clefable's ability to pressure foes like Mega Medicham, Mega Lopunny, and Dragonite. In return, Mega Tyranitar pressures troublesome walls for Clefable, such as Galarian Slowking and Heatran, and sets up Stealth Rock, while Kingambit threatens checks like Gholdengo and Galarian Slowking. Entry hazards like Stealth Rock and Spikes synergize incredibly with Clefable, as they help it secure KOs more reliably and clean up late-game, wearing down checks like Heatran. Therefore, entry hazard setters like Ferrothorn, Ting-Lu, and Gliscor are solid partners. Gliscor, in particular, is also capable of crippling the opposing team with Knock Off and removing items like Heavy-Duty Boots from Zapdos. Gliscor also helps Clefable by absorbing Knock Off and status for Unaware Clefable. There are a few Steel-type Pokemon that can take on boosted Moonblast effortlessly, such as Heatran, Melmetal, and Gholdengo. As a result, Clefable appreciates teammates that threaten these Pokemon, such as Great Tusk, Mega Lopunny, and Volcarona. Despite Clefable's great bulk, it still has trouble setting up in front of offensive Steel-types like Kingambit and Mega Scizor; therefore, defensive checks like Zamazenta and Zapdos are great partners.",
    "target": "冥想皮可西作为一个高灵活度的强化清场手，能有效地利用其耐久，优秀的防御属性，与强力特性魔法防守和纯朴。魔法防守提供的场地伤害免疫非常有用，同时让它免疫天蝎王的剧毒，并且可为队友抵挡异常状态，尤其是它已经中毒时。纯朴使其成为剑舞烈咬陆鲨和健美雄伟牙等依赖强化的宝可梦强力的check。冥想使皮可西能够额外check超级蒂安希等威胁，也让它在面对大多数对手时不那么被动。月亮之力带来的特攻下降让卡璞•蝶蝶等对手更难突破它。拍落能移除诸如超坏星、席多蓝恩和火神蛾等不惧强化后月亮之力的宝可梦的厚底靴和吃剩的东西等关键道具。但是喷射火焰可以打击钢属性的超级巨钳螳螂和赛富豪，同时打雷能压制钢铠鸦和超坏星等盾牌，并以中性伤害打击席多蓝恩，虽然它的命中不那么可靠。由于其更高的威力和麻痹概率，打雷比十万伏特更好，但是携带后者也是可行的。皮可西需要携带生蛋以提供稳定且直接的回复。吃剩的东西是另一个延长续航的道具，提供被动回复以在长线对局保持压制关系。生命宝珠带来的伤害提升很有价值，帮助皮可西在一次冥想强化后2HKO古鼎鹿，并在未强化时用月亮之力OHKO武道熊师-连击流，而且由于魔法防守特性没有反伤。如果皮可西选择纯朴特性，那就需要厚底靴以保护它不受撒菱，特别是毒菱的影响，这对它强化清场和check前文的强化清场手至关重要。\n皮可西适合加入平衡队，这种队伍青睐其对如未携带重磅冲撞的藏玛然特等物理威胁强化的能力，同时还能作为致胜手段。像超级班基拉斯和仆刀将军等宝可梦会受益于皮可西压制超级恰雷姆、超级长耳兔和快龙等对手的能力。作为回报，Mega班基拉斯能压制伽勒尔呆呆王和席多蓝恩等妨碍皮可西的盾牌，并设置隐形岩；而仆刀将军则能威慑赛富豪和伽勒尔呆呆王等check。隐形岩和撒菱等场地伤害与皮可西配合极佳，能帮助它更稳定地KO对手并在终局清场时削弱席多蓝恩等check。因此，像坚果哑铃、古鼎鹿和天蝎王这类撒钉手都是可靠队友，特别是天蝎王，还能通过拍落移除闪电鸟等对手的厚底靴，并通过抵抗拍落和异常状态来辅助纯朴特性皮可西。部分钢属性宝可梦，如席多蓝恩、美录梅塔和赛富豪等能轻松抵挡强化后的月亮之力，因此皮可西需要搭配诸如雄伟牙、超级长耳兔和火神蛾等能威胁这些钢属性宝可梦的队友。尽管皮可西耐久出色，但仍然难以对仆刀将军和超级巨钳螳螂等进攻型钢属性宝可梦强化，因此它青睐藏玛然特和闪电鸟等防御型check。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]