[
  {
    "source": "Dragonite is a very intriguing sweeper, as it is able to set up reliably in the face of offensive Pokemon like Urshifu-R, Ogerpon-W, and Mega Charizard Y. Earthquake allows it to target foes such as Gholdengo, Heatran, and Toxapex, preventing them from staying in to spread status such as Thunder Wave from the former and Toxic from the latter two. Ice Spinner grants Dragonite the ability to threaten foes like Gliscor and Landorus-T, which are usually key defensive pillars of their teams, and stops them from coming in for free to land Toxic on Dragonite. Ice- and Ground-type coverage additionally hits a vast amount of Pokemon in the metagame. Roost gives Dragonite the longevity to answer Pokemon like Ogerpon-W and Urshifu-R and also provides more setup opportunities for Dragon Dance, which allows Dragonite to break through foes like Toxapex and Ferrothorn. Extreme Speed can be used over Roost, as it helps Dragonite pick off weakened faster Pokemon like Iron Valiant and Tapu Koko that would normally outspeed and threaten it. Dual Wingbeat hits Pokemon such as Great Tusk and Zamazenta significantly harder.\nDragonite is used on a plethora of different bulky offense and balance teams as they appreciate Dragonite's defensive utility, with it being able to switch into offensive Water-types like Urshifu-R and Ogerpon-W and find many different opportunities to set up Dragon Dance. Pokemon like Mega Diancie appreciate Dragonite's ability to respond to foes like Choice Scarf Urshifu-R and Landorus-T. In return, Mega Diancie can pressure Dragonite’s checks like Ferrothorn with Mystical Fire and Zapdos with Diamond Storm. Dragonite can have a difficult time in the face of Pokemon such as Choice Scarf Tapu Lele that still outspeed it after a Dragon Dance and threaten Dragonite, so it values the presence of Steel-types like Gholdengo and Heatran to switch into it. Scale Shot Garchomp and Icicle Spear Kyurem also outspeed and break through Dragonite's Multiscale. Therefore, allies such as Choice Scarf Tapu Lele and Booster Energy Iron Valiant are appreciated to outspeed and threaten these foes. Kingambit also helps versus Air Balloon Gholdengo, which Dragonite does not immediately threaten. Volcarona is also an effective partner, as it can respond to Pokemon that directly threaten Dragonite like Choice Scarf Tapu Lele and Speed Booster Energy Iron Valiant, of which the former blocks Dragonite’s Extreme Speed with Psychic Terrain. Great Tusk is an effective partner, since it is able to wear down checks such as Landorus-T with both Stealth Rock and Ice Spinner, letting Dragonite break through opposing teams more easily in the middle stages of the game. Great Tusk can also help break through Toxapex with Headlong Rush and hit Ferrothorn with Close Combat. In return, Dragonite responds to Water-types like Urshifu-R and Ogerpon-W that force out Great Tusk.",
    "target": "快龙是一位极具魅力的强化型清场手，因其能在武道熊师-连击流、厄诡椪-水井面具、超级喷火龙Y等进攻型宝可梦面前稳定完成强化。地震能有效打击赛富豪、席多蓝恩和超坏星等目标，阻止它们留场施加异常状态——前者常使用电磁波干扰，后两者则多携带剧毒。冰旋使快龙能够威胁天蝎王和土地云-灵兽等常见队伍防御核心，避免它们自由上场对快龙使用剧毒。冰/地面打击面还能覆盖环境中大量宝可梦。羽栖为快龙提供了续航，持续对抗厄诡椪-水井面具和武道熊师-连击流，同时创造更多龙之舞强化机会，使其能突破超坏星和坚果哑铃等障碍。神速可替代羽栖，帮助快龙收割铁武者和卡璞·鸣鸣等被削弱的可通过速度优势威胁快龙的宝可梦。而双翼则能对雄伟牙和藏玛然特等对手造成更高伤害。\n快龙常见于多种平衡攻与平衡队中，其防御能力备受青睐——既能换挡武道熊师-连击流、厄诡椪-水井面具等进攻型水属性宝可梦，又经常能找到龙之舞的强化时机。超级蒂安希等队友尤为欣赏快龙应对围巾武道熊师-连击流、土地云-灵兽等威胁的能力；作为回报，超级蒂安希可通过魔法火焰压制坚果哑铃、钻石风暴威慑闪电鸟等快龙的check。面对围巾卡璞·蝶蝶等即便快龙完成一次龙之舞后仍能超速并威胁快龙的对手时，快龙容易陷入被动，因此需要赛富豪和席多蓝恩等钢属性队友换挡。鳞射烈咬陆鲨与冰锥酋雷姆能超速快龙同时能突破多重鳞片，因此它青睐围巾卡璞·蝶蝶或驱劲能量加速铁武者等高速队友帮忙处理。仆刀将军则能协助应对气球赛富豪这类快龙不能马上威胁的目标。 火神蛾也是优秀的搭档，能有效处理围巾卡璞·蝶蝶、驱劲能量加速铁武者等直接威胁快龙的宝可梦，前者还能通过精神场地封锁先制招式神速。雄伟牙能凭借隐形岩与冰旋削弱土地云-灵兽等check，帮助快龙在游戏中期更轻松地突破敌方防线；其突飞猛扑可击败超坏星，近身战则能重创坚果哑铃。作为回报，快龙可以处理迫使雄伟牙下场的武道熊师-连击流、厄诡椪-水井面具等水属性对手。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]