[
  {
    "source": "Kingambit is a highly threatening sweeper thanks to Swords Dance boosting its already high Attack, powerful STAB priority in Sucker Punch, and a unique ability in Supreme Overlord. Kingambit also provides a team with notable defensive utility, as it checks dangerous foes such as Gholdengo, Mega Latios, and Iron Crown thanks to its typing and access to Sucker Punch. Knock Off is Kingambit's most powerful STAB move under most circumstances, and it can remove items from Pokemon that check it, such as Great Tusk, Zamazenta, and Landorus-T. Sucker Punch is mandatory to make up for Kingambit's low Speed, allowing it to revenge kill faster threats such as the aforementioned Gholdengo and Mega Latios as well as others such as Ogerpon-W, Volcarona, and Iron Moth. Low Kick is the preferred coverage to hit foes such as opposing Kingambit, Melmetal, Ferrothorn, and Ting-Lu, as it OHKOes all of them after Stealth Rock at +2. Iron Head is an alternative that hits Clefable and Mega Diancie, but its targets are generally less important and Kingambit must be very healthy if it hopes to beat the latter one-on-one. Black Glasses gives Kingambit a notable boost to its Dark-type STAB moves, letting it hit important benchmarks such as OHKOing offensive Gholdengo as well as, at +2, Ogerpon-W with Sucker Punch and greatly improving Knock Off's damage rolls into important defensive Pokemon such as Alomomola and Toxapex, especially with Supreme Overlord active. Air Balloon gives Kingambit a one-time opportunity to dodge revenge killing attempts by or set up in the face of Ground-types such as Landorus-T, Gliscor, and Garchomp. Leftovers gives Kingambit passive recovery and improves its longevity, letting it check Gholdengo throughout a game for its team. An Adamant nature is preferred to hit as hard as possible, but Jolly allows Kingambit to, at worst, Speed tie with opposing Kingambit as well as outrun a few other notable threats such as Moltres, Ursaluna, and Mega Mawile. Supreme Overlord powers up Kingambit as its allies faint; this becomes incredibly dangerous in late-game scenarios, as Kingambit gains a large damage boost if many or all of its teammates have been taken down. Defiant can be situationally useful on certain hyper offense teams that value its ability to punish Defog attempts from Gliscor, Zapdos, and Landorus-T, as well as punishing Intimidate from the last one; this is generally best used with Air Balloon to protect Kingambit from Gliscor and Landorus-T. However, Supreme Overlord is generally more consistent, and hyper offense teams often have better ways to punish or outright deny Defog.\nKingambit fits on many offensive teams thanks to the immense amount of pressure it exerts while also giving such teams a check to dangerous Ghost- and Psychic-types such as Gholdengo, Iron Crown, and Mega Latios. Kingambit's presence as a top threat in the metagame means that every team has a method of dealing with it, usually through faster Dark-resistant Pokemon such as Great Tusk, Zamazenta, Iron Valiant, and Hisuian Samurott; these are often backed up by secondary answers such as defensive Landorus-T, Alomomola, and Moltres. Kingambit can help itself out early-game by spamming Knock Off into these threats in order to remove Heavy-Duty Boots from Great Tusk, Zamazenta, and Alomomola. This strategy pairs very well with entry hazard setters, making teammates such as Landorus-T, Ferrothorn, and Gliscor great partners. The latter two are also capable of setting Spikes, which wear down Fighting-types like Urshifu-R for Kingambit. A teammate that can pivot into Fighting-types is also mandatory, as Kingambit tends to invite them into battle. Zapdos, Moltres, defensive Landorus-T, and Toxapex are good teammates as a result. Psychic- and Fairy-type offensive teammates also pair well with Kingambit, since they scare many of its Fighting- and Dark-type answers. Mega Latios, Iron Crown, Mega Diancie, or Iron Valiant combine with Kingambit to create a brutal offensive core, while the Psychic-types in particular appreciate Kingambit threatening Galarian Slowking and Gholdengo. Despite being a Steel-type, Kingambit fears Tapu Lele due to Psychic Terrain blocking Sucker Punch and it commonly carrying coverage moves that target Kingambit's weaknesses, so solid Tapu Lele checks such as Gholdengo and Melmetal are good teammates.",
    "target": "凭借剑舞对其本就高额的攻击的强化、强力的属性一致先制招式突袭以及专属特性大将的加成，仆刀将军成为了极具威胁的清场手。同时得益于其属性组合与突袭的存在，仆刀将军还能为队伍提供显著的防御作用，能够check诸如赛富豪、超级拉帝欧斯与铁头壳等危险对手。拍落是仆刀将军在多数情况下威力最高的属性一致招式，可移除如雄伟牙、藏玛然特与土地云-灵兽等check持有的道具。为弥补低速缺陷，突袭是必备招式，使其能够复仇杀上述赛富豪、超级拉帝欧斯以及厄诡椪-水井面具、火神蛾和铁毒蛾等高速威胁。踢倒作为首选补盲招式，可打击同类仆刀将军、美录梅塔、坚果哑铃与古鼎鹿等目标，在隐形岩削弱它们后+2时能OHKO它们。铁头作为替代选项可针对皮可西与超级蒂安希，但这些目标通常并不重要且若要在一对一中击败后者需保持较为健康的HP。黑色眼镜能显著增强其恶属性一致招式威力，使突袭能OHKO进攻向赛富豪，在+2攻击时OHKO厄诡椪-水井面具，同时大幅提升拍落对保姆曼波和超坏星等盾牌造成的伤害，尤其在有大将特性加成时效果更为显著。气球赋予仆刀将军一次性的地面属性免疫效果，使其能躲过地面属性宝可梦如土地云-灵兽、天蝎王和烈咬陆鲨的复仇杀或提供强化机会。吃剩的东西提供持续回复能力，延长仆刀将军的续航，使其能持续为队伍压制赛富豪。固执性格能最大化攻击，而爽朗性格则让仆刀将军至少能与同类拼速，甚至能超速火焰鸟、月月熊和超级大嘴娃等威胁。大将特性会随着队友倒下不断强化仆刀将军的输出，残局中若多数或全部队友已倒下，该特性将带来极为可观的伤害增幅。不服输特性在特定HO队中有战术价值，能有效反制天蝎王、闪电鸟和土地云-灵兽的清除浓雾，并针对土地云-灵兽的威吓特性，此时需要搭配气球以免疫前两者的地面属性招式。但大将特性整体更为稳定，且HO队通常存在更优手段来反制或直接封锁清除浓雾。\n仆刀将军凭借其施加的巨大压力以及作为幽灵属性和超能力属性威胁如赛富豪、铁头壳与超级拉帝欧斯的check，成为众多进攻型队伍的优选。作为环境中的顶级威胁，仆刀将军的存在使得每支队伍都会配备针对手段，通常通过速度更快的抵抗恶属性宝可梦如雄伟牙、藏玛然特、铁武者或洗翠大剑鬼来处理它，它们往往会配合防御型土地云-灵兽、保姆曼波与火焰鸟等次要反制手段。仆刀将军在前期可对上述威胁频繁使用拍落，有效清除雄伟牙、藏玛然特和保姆曼波的厚底靴，以配合撒钉手。土地云-灵兽、坚果哑铃与天蝎王因此成为优秀的队友，其中后两者还能设置撒菱持续削弱武道熊师-连击流等格斗属性对手。鉴于仆刀将军易吸引格斗属性宝可梦上场，携带能换挡格斗属性的队友至关重要，闪电鸟、火焰鸟、防御型土地云-灵兽与超坏星均是理想选择。超能力属性与妖精属性攻击手与仆刀将军配合无间，能威慑其格斗属性与恶属性天敌。超级拉帝欧斯、铁头壳、超级蒂安希和铁武者可与仆刀将军构筑强力的进攻轴，其中超能属性队友尤其受益于仆刀将军威胁伽勒尔呆呆王与赛富豪的能力。值得注意的是，虽然具有钢属性，仆刀将军仍需警惕卡璞·蝶蝶，因为精神场地会阻止突袭，且其常携带针对钢属性的补盲招式。因此搭配赛富豪与美录梅塔等卡璞·蝶蝶坚实的check十分必要。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]