[
  {
    "source": "With a powerful Water-type STAB move, one of the best setup moves ever in Tail Glow, and the combination of Hydration + Rest, Manaphy is one of the fiercest wallbreakers on rain teams, leveraging its all-around bulk to take some hits and either set up Tail Glow, hit back with incredibly powerful boosted Surfs, or heal off said hits with Rest in rain. With these traits, Manaphy can virtually take out any wall, breaking through even specially defensive Water-resistant Pokemon like Ferrothorn and Mega Latias with its very powerful Hydro Vortex while also healing off any chip damage from foes like Blissey thanks to Hydration + Rest. Hydration additionally lets Manaphy deny status from the likes of Gliscor, Toxapex, and Tera Grass Heatran. This gives rain teams a much better fat balance and stall matchups, since the only way to take it out is with offensive pressure. Psychic is used as coverage for a would-be check in Toxapex, but Energy Ball is a good alternative for hitting Dondozo and Tera Water Garganacl for super effective damage. Pelipper is a required partner for setting up rain and pivoting Manaphy in. Other partners like Ferrothorn and Archaludon are appreciated due to their ability to take on Pokemon like Rillaboom, Ogerpon-W, and Raging Bolt that force out Manaphy, and, in Ferrothorn's case, it can also chip said Pokemon with entry hazards while taking them on. In return, Manaphy can take out troublesome foes like Ting-Lu and Heatran for said partners. Swift Swim Pokemon like Mega Swampert and Barraskewda are appreciated for their ability to pressure more offensive teams that can deny Manaphy setup opportunities, and in return, Manaphy can break through Pokemon like Alomomola and Rotom-W. Zapdos and Raging Bolt are also great partners because they can take Grass-type attacks from Rillaboom and Ogerpon-W and hit Toxapex and Dondozo; meanwhile, Manaphy can do devastating damage to its partners' checks in Galarian Slowking and Mega Tyranitar.",
    "target": "玛纳霏拥有强力的水属性一致招式，配合目前为止最好的强化招式之一萤火，搭配湿润之躯和睡觉的组合，是雨天队伍中最凶猛的破盾手之一。它可以凭借自己平衡的耐久承受一些攻击，然后利用萤火强化后威力巨大的冲浪进行反击，或是通过在雨天的睡觉来治愈这些伤害。凭借这些特点，玛纳霏几乎可以摧毁任何盾牌，甚至可以用它非常强大的超级水流大漩涡来突破坚果哑铃和超级拉帝亚斯等抗水特耐盾牌，同时也能通过湿润之躯和睡觉来治愈幸福蛋等敌人的任何消耗。湿润之躯还能让玛纳霏免受天蝎王、超坏星和太晶草席多蓝恩的异常状态。在面对高耐久的平衡队和受队时，这给予了雨天队更优秀的MU，因为只有靠进攻压力才能处理玛纳霏。虽然精神强念用来打击可能的check——超坏星，但是能量球也是一个好的选择，因为它能对吃吼霸和太晶水岩石巨灵造成效果拔群的伤害。大嘴鸥能开雨天并且作为中转使玛纳霏换入，因此它是一个必需的队友。玛纳霏很欣赏坚果哑铃和铝钢桥龙这样的队友，因为它们有能力抵挡轰擂金刚猩、厄诡椪-水井面具和猛雷鼓等可以逼退玛纳霏的宝可梦，而且坚果哑铃还能在抵挡它们的同时利用场地伤害消耗上述宝可梦。作为回报，玛纳霏能为上述队友解决古鼎鹿和席多蓝恩等麻烦的敌人。超级巨沼怪和戽斗尖梭等悠游自如特性的宝可梦也很受欢迎，因为它们可以向更多不给玛纳霏强化机会的攻队施压，而且作为回报，玛纳霏能突破保姆曼波和洛托姆-清洗等宝可梦。闪电鸟和猛雷鼓能抵挡来自轰擂金刚猩和厄诡椪-水井面具的草属性招式并且打击超坏星和吃吼霸，因此同样是很棒的队友；同时，玛纳霏能对它的队友的checks——伽勒尔呆呆王和超级班基拉斯造成毁灭性的伤害。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]