[
  {
    "source": "Gholdengo is a premier defensive piece due to its incredible ability and typing, which helps it check threats like Tapu Lele, Mega Medicham, and Zamazenta while also being immune to Great Tusk and Terapagos’s Rapid Spin and Defog from Tornadus-T and Zapdos. Focus Blast allows Gholdengo to hit would-be checks in Kingambit, Mega Tyranitar, and Terapagos without Tera Shell. Thunder Wave allows Gholdengo to slow down Pokemon such as Terapagos, Ogerpon-W, and Heatran. Hex is boosted to new heights because of Thunder Wave, and it severely damages Gliscor. Ghostium Z allows Gholdengo to greatly harm Pokemon that are unable to be paralyzed by Thunder Wave such as Raging Bolt, Zapdos, Great Tusk, and Landorus-T. Leftovers allows Gholdengo to have an easier time switching in against Pokemon like Tapu Lele and Iron Valiant repeatedly. Fightinium Z helps Gholdengo secure OHKOs on Assault Vest Kingambit, Mega Tyranitar, and Terapagos without Tera Shell while also being more reliable to hit with than Focus Blast. Air Balloon allows Gholdengo to be completely immune to Ground-type attacks from the likes of Gliscor and Great Tusk and block Rapid Spin from Great Tusk more effectively. The given EVs allow Gholdengo to outspeed uninvested Landorus-T and Jolly Kingambit while avoiding the OHKO from Choice Specs Dragapult.\nGholdengo fits on various playstyles where its paralysis support and incredible defensive utility are valued. Teammates that set up entry hazards like Hisuian Samurott and Ting-Lu are perfect partners for Gholdengo because of it being an effective blocker of hazard removal from Terapagos and Great Tusk, especially if it is holding Air Balloon. Wallbreakers such as Mega Medicham and Ogerpon-W benefit from Gholdengo checking revenge killers like Tornadus-T, Choice Scarf Tapu Lele, and Zamazenta while also slowing down these faster threats with Thunder Wave. Gholdengo is unable to consistently break through Pokemon like Ting-Lu and Volcarona and is passive against Zapdos and Raging Bolt if it is unable to use a Z-Move. It is also easily outpaced by threats like Dragapult, Mega Lopunny, and Mega Charizard Y, limiting its ability to stay on the field safely. Teammates like Dragonite, Mega Tyranitar, and Zamazenta are great partners to help work around these issues. Iron Valiant is also a great partner for Gholdengo, as it appreciates Gholdengo paralyzing faster revenge killers like Tapu Lele and Tornadus-T, and in return, it takes care of Pokemon like Hisuian Samurott and Kingambit for Gholdengo.",
    "target": "赛富豪凭借其优秀的特性和属性，能够check卡璞•蝶蝶、超级恰雷姆和藏玛然特等威胁，同时免疫雄伟牙和太乐巴戈斯的高速旋转以及龙卷云-灵兽和闪电鸟的清除浓雾，成为了强力的防御核心。真气弹能够打击可能的check，如仆刀将军、超级班基拉斯和太晶甲壳未生效的太乐巴戈斯。电磁波可以减速太乐巴戈斯、厄诡椪-水井面具和席多蓝恩。祸不单行可以利用电磁波的效果来提升威力，并有力地打击天蝎王。幽灵Z可以沉重打击不能被电磁波麻痹的对手，如猛雷鼓、闪电鸟、雄伟牙和土地云-灵兽。吃剩的东西帮助它更轻松地多次换挡卡璞•蝶蝶和铁武者等宝可梦。 而格斗Z可以确保OHKO突击背心仆刀将军、超级班基拉斯和太晶甲壳未生效的太乐巴戈斯，同时也比直接使用真气弹更可靠。 携带气球的赛富豪能够免疫天蝎王和雄伟牙的地面属性招式，更有效地阻止雄伟牙清钉。给定的努力值分配帮助赛富豪超速未投入速度努力值的土地云-灵兽和爽朗仆刀将军，同时避免被讲究眼镜多龙巴鲁托OHKO。\n赛富豪能够融入多种队伍体系，用电磁波和它的防御能力辅助队伍。洗翠大剑鬼和古鼎鹿等可以设置场地伤害的队友是赛富豪的好搭档，因为赛富豪能有效阻止太乐巴戈斯和雄伟牙清钉，特别是携带气球的配置。赛富豪可帮助超级恰雷姆和厄诡椪-水井面具等破盾手check龙卷云-灵兽、讲究围巾卡璞•蝶蝶和藏玛然特等复仇杀手，并为它们用电磁波减速更高速的威胁。赛富豪始终难以突破古鼎鹿和火神蛾等宝可梦，同时如果不携带Z纯晶则在对位闪电鸟和猛雷鼓时较为被动。 它容易被多龙巴鲁托、超级长耳兔和超级喷火龙Y等宝可梦威胁，限制它安全留场。快龙、超级班基拉斯和藏玛然特等优质队友可以帮助赛富豪解决这些问题。铁武者也是很好的队友，它青睐赛富豪麻痹卡璞•蝶蝶和龙卷云-灵兽等更高速复仇杀手的能力。作为回报，它可以帮助赛富豪处理洗翠大剑鬼和仆刀将军。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]