[
  {
    "source": "Kartana serves as a good check to Pokemon like Garchomp, Mega Tyranitar, and Ogerpon-W lacking Superpower, while packing good utility with Defog. Its great matchup versus the former two, along with Gliscor, Landorus-T, and Ferrothorn exacerbate this, being particularly one of the most effective Defoggers in the metagame. With Grassium Z, Kartana is even more effective at removing entry hazards, being able to deal a massive blow to Garchomp, Landorus-T, and Gliscor, KOing even the latter two with minor chip. Knock Off is Kartana's coverage move of choice, removing Heavy-Duty Boots from the likes of Tornadus-T, Zapdos, and Volcarona while giving it an avenue to make meaningful progress against Ferrothorn, Heatran, and Galarian Slowking. The given EV spread lets Bloom Doom OHKO offensive Garchomp, which could otherwise comfortably tank Leaf Blade and KO Kartana with its +2 Earthquake. Due to Kartana's ability to often lure Ground-types like Landorus-T, Gliscor, and Garchomp with its Bloom Doom, Tapu Koko makes for an excellent teammate, also appreciating Kartana's ability to keep Ferrothorn's entry hazards off the field; in return, Tapu Koko can check Flying-types like Zapdos and Tornadus-T for Kartana. Teammates that benefit from Kartana’s entry hazard removal like Nasty Plot Tornadus-T and Mega Charizard Y form a nice core with it as well, allowing them to stay healthy and hit the field to help break down Kartana’s checks like Zapdos and Heatran. Kartana is not without flaw as a Defogger; it is most notably helpless against Stealth Rock Heatran, so teammates that assist with Heatran such as Gliscor and Hisuian Samurott work well, being able to often trade entry hazards to help mitigate Kartana's inability to safely clear them in the face of Heatran. Furthermore, Kartana’s terrible Special Defense renders it unable to check Tapu Lele and Tapu Koko effectively unlike other Steel-types like Ferrothorn adnd Heatran, so teammates like Galarian Slowking, Weavile, and Landorus-T can ease these matchups.\nWritten by:\nuser link here\nQuality checked by:\nuser link 1 here\nuser link 2 here\nGrammar checked by:\nuser link here",
    "target": "纸御剑能很好地check烈咬陆鲨、超级班基拉斯和不携带蛮力的厄诡椪-水井面具，同时它还有实用的清除浓雾。纸御剑面对烈咬陆鲨、超级班基拉斯、天蝎王、土地云-灵兽和坚果哑铃时能占据优势，这让它成为了环境内最高效的清除浓雾使用者之一。凭借草Z，纸御剑扫钉的能力得以更上一层楼，因为它能对烈咬陆鲨、土地云-灵兽和天蝎王造成大量伤害，甚至只需少量消耗就能KO后面两位。拍落是纸御剑的重要补盲招式，能移除龙卷云-灵兽、闪电鸟和火神蛾等宝可梦的厚底靴，同时让纸御剑在面对坚果哑铃、席多蓝恩和伽勒尔呆呆王时可以有效地推进对局。上述努力值分配确保了绚烂缤纷花怒放可以OHKO攻向烈咬陆鲨，否则后者就能轻松吃下叶刃并用攻击+2下的地震反杀纸御剑。纸御剑能吸引土地云-灵兽、天蝎王和烈咬陆鲨等地面属性宝可梦上场，并用绚烂缤纷花怒放击倒它们，因此卡璞・鸣鸣是它绝佳的队友，卡璞・鸣鸣还很欣赏纸御剑可以扫掉坚果哑铃的钉子；作为回报，卡璞・鸣鸣能帮它check闪电鸟和龙卷云-灵兽等飞行属性宝可梦。诡计龙卷云-灵兽和超级喷火龙Y也很适合搭配纸御剑，纸御剑的扫钉能力可以让它们保持健康的血量来上场突破闪电鸟和席多蓝恩等纸御剑的check。纸御剑作为扫钉手也不是完美的；它最大的问题便是会面对隐形岩席多蓝恩束手无策，因此很适合天蝎王和洗翠大剑鬼等可以压制席多蓝恩的队友，它们还能跟对手互相撒钉来缓解纸御剑没法面对席多蓝恩安全扫地这个问题。此外，不像坚果哑铃和席多蓝恩等其它钢属性宝可梦，纸御剑贫弱的特防使它没法check卡璞・蝶蝶和卡璞・鸣鸣，所以它需要伽勒尔呆呆王、玛狃拉和土地云-灵兽等队友来处理这些对位。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]