[
  {
    "source": "Tornadus-T acts as a formidable wallbreaker, taking advantage of its impressive Speed, solid Special Attack, and wide coverage options to set up with Nasty Plot; additionally its decent bulk and Regenerator allow it to exploit passive Pokemon, such as Corviknight and Alomomola, for setup opportunities. Nasty Plot allows Tornadus-T to boost its decent Special Attack to even greater heights, letting it break through defensive Pokemon like Toxapex, Gliscor, and Ferrothorn. Bleakwind Storm is an alternative STAB move with greater accuracy than Hurricane, although it is slightly weaker. Heat Wave hits Pokemon that are not threatened by Tornadus-T's STAB move, such as Gholdengo, Zapdos, and Ferrothorn. Focus Blast provides crucial coverage against Rock- and Steel-type foes that take little damage from Tornadus-T's STAB move and Heat Wave, such as Mega Tyranitar and Heatran, and also hits Ting-Lu for super effective damage. Taunt blocks Toxic from foes like Gliscor and Toxapex and Thunder Wave from Ferrothorn while additionally letting Tornadus-T effectively beat stall by itself. Flyinium-Z allows Tornadus-T to secure KOs against the likes of Toxapex, Mega Diancie, and Mega Charizard-Y, all of which get OHKOed after one Nasty Plot boost.\nTornadus-T thrives on more offensively oriented team compositions, where it can contribute by setting up and breaking through opposing teams to support its allies. Its ability to pressure foes like Great Tusk, Ogerpon-W, and Iron Valliant opens up teammates such as Gholdengo, Heatran, and Ting-Lu to play more freely. Other Pokemon that appreciate Tornadus-T's wallbreaking capabilities include Urshifu-R and Raging Bolt, as they benefit from Tornadus-T's ability to pressure their respective checks like Slowbro and Ferrothorn. Ting-Lu, Garchomp, and Gliscor are also solid partners thanks to their ability to handle Electric- and Rock-type foes like Zapdos, Tapu Koko, and Mega Diancie that threaten Tornadus-T. Landorus-T also handles these threats, as well as providing Defog support, which Tornadus-T greatly appreciates due to its Stealth Rock weakness. Ferrothorn is another notable partner, as it can switch into any attack from the likes of Tapu Koko while also providing entry hazards for Tornadus-T. Terapagos is also a solid teammate for Tornadus-T because it provides Rapid Spin support, which Tornadus-T greatly appreciates due to its Stealth Rock weakness, and it is also a natural fit for offensive teams that Tornadus-T thrives in.",
    "target": "龙卷云-灵兽是极具威胁的破盾手，其具有出色的速度、高额的特攻、广泛的打击面和诡计；其良好的耐久与再生力特性还可利用钢铠鸦、保姆曼波等被动宝可梦创造强化机会。诡计能将本就不俗的特攻提升至更高层次，可击穿超坏星、天蝎王和坚果哑铃等盾牌。枯叶风暴作为属性一致招式的替代选择，虽威力略逊于暴风，但命中更为可靠。热风能打击赛富豪、闪电鸟和坚果哑铃等不惧其属性一致招式的对手。真气弹提供关键补盲，可重创属性一致招式和热风无法打击的岩和钢属性的对手，如超级班基拉斯和席多蓝恩，同时对古鼎鹿也能造成效果拔群的伤害。而挑衅则能封锁天蝎王、超坏星的剧毒与坚果哑铃的电磁波，更能让龙卷云独自破受。飞行Z纯晶可确保在一次诡计强化后OHKO超坏星、超级蒂安希和超级喷火龙Y等目标。\n龙卷云-灵兽在偏进攻向的队伍中表现出色，它能通过强化并突破对方联防来支援队友。其压制雄伟牙、厄诡椪-水井面具和铁武者等对手的能力，可使赛富豪、席多蓝恩和古鼎鹿等队友获得更自由的发挥空间。其他受益于龙卷云-灵兽破盾能力的宝可梦还包括武道熊师-连击流和猛雷鼓，因其能有效压制呆壳兽和坚果哑铃等它们分别的check。古鼎鹿、烈咬陆鲨和天蝎王也是优秀的搭档，能应对闪电鸟、卡璞·鸣鸣和超级蒂安希等威胁龙卷云-灵兽的电和岩属性宝可梦。土地云-灵兽也能处理这些威胁，还能提供清除浓雾支援，这对弱隐形岩的龙卷云-灵兽至关重要。坚果哑铃同样是有价值的搭档，既能对卡璞·鸣鸣的任何攻击换入，又能为龙卷云-灵兽设置场地伤害。太乐巴戈斯也是优秀队友，其高速旋转能清除隐形岩，完美契合龙卷云-灵兽所在的进攻型队伍体系。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]