[
  {
    "source": "Gholdengo is a good wallbreaker and glue for offense and hyper offense teams thanks to its access to Nasty Plot, its ability, Good as Gold, and its typing, which blocks entry hazard removal from Terapagos and Tornadus-T while also having useful resistances to threats such as Tapu Lele and Iron Valiant. Nasty Plot allows Gholdengo to OHKO Pokemon such as Heatran and Tapu Koko at +2. Make It Rain is a powerful STAB move that can allow a boosted Gholdengo to take down Pokemon that Shadow Ball can't, such as Gliscor, offensive Garchomp, and Landorus-T, OHKOing all of them after a boost. Recover can be slotted over Make It Rain in order to increase Gholdengo’s longevity, allowing it to check threats like Iron Valiant and Tapu Lele for longer. Focus Blast is a move that complements Gholdengo’s Ghost-type STAB moves, punching holes into would-be switch-ins like Kingambit, Ting-Lu, and Heatran. Air Balloon allows Gholdengo to spinblock and threaten Great Tusk, Iron Treads, and Terapagos lacking Flamethrower. Ghostium-Z is a powerful option, and when used in tandem with Nasty Plot, it allows Gholdengo to OHKO specially defensive Garchomp, Moltres, and Toxapex while also OHKOing the previously mentioned Heatran without relying on the shaky accuracy of Focus Blast. Fightinium-Z is another option that allows Gholdengo to bypass Focus Blast’s limited accuracy, notably OHKOing Ting-Lu and Assault Vest Melmetal after a boost.\nGholdengo acts as a valuable asset for most offensive team structures with its ability to deny hazard control while also having incredible wallbreaking potential. Pokemon such as Glimmora, Ting-Lu, and Hisuian Samurott benefit from Gholdengo’s ability to keep hazards up. Additionally, the latter two enjoy Gholdengo’s unique typing, which can help blanket check Fairy- and Fighting-type foes such as Tapu Lele and Mega Medicham. Other Pokemon that enjoy Gholdengo’s wallbreaking capabilities include Raging Bolt and Urshifu-R, as they benefit immensely from Gholdengo removing and overwhelming checks like Ferrothorn and Slowbro. Gholdengo fears Pokemon such as Kingambit and Hisuian Samurott; (ASC) therefore, Pokemon that can reliably deal with these Dark-types, such as Great Tusk and Zamazenta, (AC) are greatly appreciated. Having Pokemon immune to Ground-type attacks is helpful against threats such as Great Tusk and Garchomp, even if Gholdengo is holding an Air Balloon. As such, Pokemon like Landorus-T, Zapdos, and Moltres are outstanding partners. Moltres is an especially great teammate due to its ability to check the fearsome Fire-types in the metagame that Gholdengo struggles against, like Mega Charizard Y and Volcarona.",
    "target": "赛富豪凭借其掌握的诡计、黄金之躯特性以及钢+幽灵的属性组合，成为进攻和HO队中优秀的破盾手与核心成员。其属性和特性不仅能够封锁如太乐巴戈斯和龙卷云-灵兽等宝可梦的除钉手段，还能有效抵抗卡璞·蝶蝶和铁武者等威胁。诡计强化后，赛富豪能OHKO席多蓝恩、卡璞・鸣鸣等宝可梦。淘金潮作为高威力属性一致招式，强化后可击破天蝎王、进攻向烈咬陆鲨和土地云-灵兽等暗影球无法处理的威胁。若将淘金潮替换为自我再生，则可提升赛富豪的续航能力，使其能更持久地压制铁武者与卡璞・蝶蝶。真气弹作为幽灵属性一致招式的补充，能有效打击仆刀将军、古鼎鹿和席多蓝恩等常见换入。携带气球时，赛富豪可阻止雄伟牙、铁辙迹以及未携带喷射火焰的太乐巴戈斯清钉。幽灵Z配合诡计强化，赛富豪能OHKO特耐型烈咬陆鲨、火焰鸟和超坏星，同时无需依赖命中不稳定的真气弹即可OHKO席多蓝恩。格斗Z则是另一种选择，既能规避真气弹的命中问题，强化后还能OHKO古鼎鹿和突击背心美录梅塔。\n赛富豪凭借其阻止对方清钉的能力以及强大的破盾潜力，成为大多数进攻型队伍的重要成员。诸如晶光花、古鼎鹿和洗翠大剑鬼等宝可梦青睐赛富豪反扫钉的能力。后两者尤其欣赏赛富豪独特的属性组合，能换挡妖精属性与格斗属性对手，例如卡璞・蝶蝶与超级恰雷姆。其他青睐赛富豪破盾能力的宝可梦包括猛雷鼓和武道熊师-连击流，它们非常依赖赛富豪清除和过劳如坚果哑铃与呆壳兽等check。赛富豪需要警惕仆刀将军和洗翠大剑鬼等威胁，因此能稳定处理这类恶属性宝可梦的队友，如雄伟牙与藏玛然特显得尤为重要。配置免疫地面属性攻击的队友能有效应对雄伟牙与烈咬陆鲨等威胁，即使赛富豪携带气球时也同样需要。诸如土地云-灵兽、闪电鸟与火焰鸟这类飞行属性精灵是极佳的搭档选择。其中火焰鸟因能压制赛富豪难以应对的强力火属性宝可梦，例如超级喷火龙Y与火神蛾，成为特别优秀的队友选择。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]