[
  {
    "source": "Mega Latias uses its immense bulk, decent defensive typing, and Spikes immunity to become a consistent utility Pokemon that is able to spread paralysis and cripple Pokemon that would otherwise offensively pressure it such as Mega Scizor and Tapu Lele while also checking threats like Mega Charizard Y and Ogerpon-W. Psychic hits Zamazenta harder and has good neutral coverage, but Psyshock can also be used hit harder against Pokemon like Galarian Slowking and Ogerpon-W when Terastallized. Aura Sphere complements Mega Latias well, hitting Dark- and Steel-types such as Ferrothorn, Heatran, Weavile, and Mega Tyranitar. Ice Beam can also be used to hit Ground-types that are able to take advantage of Mega Latias’s passivity, such as Gliscor and Garchomp. Draco Meteor is a niche option that can be used to hit Pokemon like Raging Bolt and Gouging Fire. However, giving up Aura Sphere means Mega Latias has no way of threatening Ferrothorn, Weavile, and Mega Tyranitar for consistent damage. Thunder Wave allows Mega Latias to severely cripple setup sweepers and offensive threats like Mega Scizor and Volcarona. Although Mega Latias has Thunder Wave to cripple most of its checks, it has issues with Dark- and Steel types that are able to take advantage of its relative passivity, such as Mega Tyranitar, Heatran, Mega Scizor, and Weavile, especially if not carrying Aura Sphere. Teammates that are able to help against these Pokemon include Toxapex, Zamazenta, and Gliscor, making them good partners. Mega Latias also struggles against Dragon- and Fairy-types that are either faster than it or immune to Thunder Wave, such as Raging Bolt, Iron Valiant, and Tapu Lele, so teammates that match up well against them like Ting-Lu, Corviknight, and Toxapex are good alongside it. In return, Mega Latias is able to ease the offensive pressure these Pokemon take, using Thunder Wave to cripple their checks like Heatran, Ogerpon-W, and Rillaboom. Mega Latias enjoys entry hazards wearing down its checks such as Mega Scizor and Mega Tyranitar, so Pokemon that set them like Ferrothorn, Clefable, and Gliscor are good teammates.",
    "target": "超级拉帝亚斯耐久极高，拥有不错的防御属性还能免疫撒菱，这让它成为了一只可靠的功能型宝可梦。它能通过电磁波麻痹废掉超级巨钳螳螂、卡璞·蝶蝶等威胁它的宝可梦，同时也能check超级喷火龙Y、厄诡椪-水井面具等威胁。精神强念泛用性很好，同时也能有效打击藏玛然特，而精神冲击能对伽勒尔呆呆王、太晶化的厄诡椪-水井面具造成更高的伤害。波导弹与超级拉帝亚斯相性极佳，补盲坚果哑铃、席多蓝恩、玛狃拉、超级班基拉斯等恶属性和钢属性的宝可梦。 冰冻光束能痛击小瞧超级拉帝亚斯进攻威胁的天蝎王、烈咬陆鲨等地面属性宝可梦。流星群则是打击猛雷鼓、破空焰等宝可梦的如意法宝。然而，放弃波导弹意味着超级拉帝亚斯面对坚果哑铃、玛狃拉以及超级班基拉斯会束手无策，无法有效造成伤害。利用电磁波，超级拉帝亚斯能够狠狠废掉敌方强化清场手和进攻手，例如超级巨钳螳螂和火神蛾。虽然电磁波能威胁那些超级拉帝亚斯的check，但不携带波导弹的超级拉帝亚斯还是因输出能力有限受制于超级班基拉斯、席多蓝恩、超级巨钳螳螂和玛狃拉这些恶属性和钢属性的宝可梦。而那些能帮助超级拉帝亚斯对抗上述宝可梦的队友便显得弥足珍贵，其中代表有超坏星、藏玛然特以及天蝎王。超级拉帝亚斯还苦于对抗那些速度快过它或是免疫电磁波的宝可梦，例如猛雷鼓、铁武者和卡璞·蝶蝶，因此古鼎鹿、钢铠鸦和超坏星这种能够帮助超级拉帝亚斯对抗它们的宝可梦很有作用。作为回报，超级拉帝亚斯能够减轻它们受到的进攻压力，利用电磁波限制席多蓝恩、厄诡椪-水井面具以及轰擂金刚猩等check。超级拉帝亚斯也乐于看到超级巨钳螳螂和超级班基拉斯等它的check受到钉子的困扰，因此坚果哑铃、皮可西和天蝎王变成了它的好帮手。\n[SET]\nCalm Mind (Latias) (F) @ Latiasite\nTimid Nature\n- Psyshock / Stored Power\n- Aura Sphere / Substitute\n[SET COMMENTS]\n凭借高耐久，属性组合以及免疫撒菱的特性，超级拉帝亚斯成为了极具威胁性的致胜点，能够在check厄诡椪-水井面具、超级恰雷姆、藏玛然特时获得冥想强化推队。作为首选的超能力属性招式，精神冲击能够更沉痛地打击伽勒尔呆呆王和火神蛾这种能够强化特防的宝可梦。辅助力量是另一种选择，它能帮助强化过的超级拉帝亚斯击败吃吼霸、皮可西这些纯朴手并且让超级拉帝亚斯在几次强化后无人能挡。波导弹能打击席多蓝恩、超级班基拉斯、玛狃拉等钢属性和恶属性宝可梦，如果不携带波导弹，它们将会完封超级拉帝亚斯或者通过追打击杀它。替身作为备选可以帮超级拉帝亚斯避免被天蝎王、保姆曼波、超坏星和伽勒尔呆呆王的变化招式重创，同时也能保证它在面对盐石巨灵、清洗洛托姆这些破除不了替身的宝可梦前建立优势。建议永远将替身和辅助力量搭配使用，因为替身能帮助超级拉帝亚斯多使用几次冥想，使辅助力量能对受队造成更沉重的打击。由于多次冥想过的超级拉帝亚斯才具有威胁性，它会被玛狃拉、卡璞·蝶蝶以及铁武者这些打手压制，而无法强化。因此，超坏星、钢铠鸦、藏玛然特这些能够check它们的宝可梦就成了超级拉帝亚斯的好帮手。即便携带了波导弹，超级拉帝亚斯还是难以处理超级巨钳螳螂、钢铠鸦、超级班基拉斯和玛狃拉这些钢属性和恶属性宝可梦 ，同时它也难以处理卡璞·蝶蝶、铁武者这些杰出妖精属性宝可梦。队友可以选择藏玛然特、耐久向火神蛾、席多蓝恩和闪电鸟这些宝可梦来对它们施压。天蝎王、坚果哑铃这些出钉手也能通过钉子消耗超级拉帝亚斯的check。作为回报，超级拉帝亚斯能处理那些能打穿一个平衡队的宝可梦，例如厄诡椪-水井面具、超级恰雷姆和藏玛然特。钢铠鸦和超级拉帝亚斯简直是天作之合，它不仅能check卡璞·蝶蝶、超级巨钳螳螂和玛狃拉，还能够清除场上的钉子。而超级拉帝亚斯承担了对席多蓝恩、清洗洛托姆和超级喷火龙Y这些火属性和电属性的宝可梦的联防。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]