[
  {
    "source": "!code Weavile's access to Swords Dance, alongside its great offensive typing, high Attack and Speed stats, and excellent STAB moves in Triple Axel and Knock Off, makes it a versatile and formidable wallbreaker capable of shredding through common defensive backbones like Landorus-T, Galarian Slowking, and Tornadus-T. Weavile can pressure Psychic-, Ground-, and Grass-types like Mega Latias, Landorus-T, and Serperior, forcing them to switch out, and set up a Swords Dance. Knock Off gives Weavile a more powerful utility presence by removing Heavy-Duty Boots and Leftovers from Toxapex and Ferrothorn. Ice Shard is useful for revenge killing and, when boosted, picking off faster, weakened threats, such as Choice Scarf Landorus-T, Mega Lopunny, and Tapu Koko. Heavy-Duty Boots allows Weavile to ignore its Stealth Rock weakness, the chip damage from Spikes, and poison from Toxic Spikes when pivoting in. Tera Dark is run to boost Knock Off, allowing Weavile to muscle through Ferrothorn, Alomomola, and Toxapex. Weavile's ability to remove items like Heavy-Duty Boots from foes like Toxapex and Alomomola cripples these defensive Pokemon's longevity and makes it easier for its teammates, like Urshifu-R and Iron Valiant, to sweep. Electric-types like Tapu Koko and Raging Bolt love Weavile's ability to threaten Ground-types like Landorus-T, Gliscor, and Ting-Lu and force them to Terastallize so that the aforementioned Electric-types can revenge kill them. Weavile's inability to directly switch into attacks hinders it's ability to reliably break down teams, so teammates like Rotom-W and Tornadus-T that can pivot it in against the likes of Galarian Slowking, Mega Latios, and Zapdos are good partners. Weavile can't afford to lose its item because damage from entry hazards racks up quickly, so teammates such as Mega Lopunny and Mega Scizor that can absorb Knock Off are appreciated. Due to Weavile's vulnerability to fast revenge killers like Zamazenta and Tapu Koko, defensive Pokemon like Galarian Slowking and Ferrothorn make for good teammates. Weavile can be answered by defensive Pokemon such as Toxapex, Ferrothorn, and Mega Scizor, so pairing Weavile with answers to them, such as Garchomp and Volcarona, is beneficial.",
    "target": "能够使用剑舞，加上其强大的进攻属性，不俗的攻击和速度，还有优秀的属性一致招式——三旋击和拍落，让玛狃拉成为了一个全能且强大的破盾手。它能够打败常见的联防核心，如土地云-灵兽、呆呆王-迦勒尔以及龙卷云-灵兽，还可以压制超能力、地面和草属性的宝可梦，如超级拉帝亚斯、土地云-灵兽和君主蛇，从而迫使它们换人并趁机使用剑舞。拍落给予了玛狃拉能够移除超坏星和坚果哑铃的厚底靴和吃剩的东西的能力，冰砾在强化后可以在一定消耗后反杀更快的宝可梦，比如携带讲究围巾的土地云-灵兽、超级长耳兔、卡璞·鸣鸣。厚底靴使玛狃拉在上场时能够避免受到隐形岩或者撒菱的伤害以及毒菱带来的中毒状态。恶属性太晶可以增强拍落的伤害以强行突破坚果哑铃，保姆曼波和超坏星。玛狃拉能够移除超坏星和保姆曼波等对手盾牌的厚底靴等道具从而削弱它们，并使其队友，如武道熊师-连击流和铁武者，能够更加容易地清场。像卡璞·鸣鸣和猛雷鼓这样的电属性宝可梦十分欣赏玛狃拉威胁土地云-灵兽、天蝎王和古鼎鹿等地面属性宝可梦的能力，这能够迫使它们太晶化，从而使这些电属性宝可梦能够反杀它们。玛狃拉薄弱的耐久使它难以找到上场机会，从而无法稳定破盾，所以像洛托姆-清洗和龙卷云-灵兽这样能够将它中转上场来应对伽勒尔呆呆王、超级拉帝欧斯和闪电鸟的宝可梦是很好的搭档。厚底靴保存血线的能力对于玛狃拉来说很重要，所以玛狃拉十分欣赏超级长耳兔和超级巨钳螳螂这种可以稳定接下拍落的精灵。由于玛狃拉害怕如藏玛然特和卡璞·鸣鸣这样的高速打手，像呆呆王-迦勒尔和坚果哑铃这样的盾牌会是玛狃拉很好的队友。由于玛狃拉会被超级巨钳螳螂、坚果哑铃和超坏星等部分盾牌check，所以玛狃拉同样需要烈咬陆鲨和火神蛾这类队友帮助它破盾。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]