[
  {
    "source": "Kartana functions as a unique offensive Defogger. It uses its good defensive typing and access to reliable recovery in Synthesis to offensively check threatening Ground-types while removing the entry hazards that they set. Its ability to threaten common hazard setters such as Gliscor, Ting-Lu, Great Tusk, and Hisuian Samurott makes it a decent Defogger even in spite of its relatively mediocre matchup versus Gholdengo. Knock Off is the preferred coverage move, as it applies some pressure to Gholdengo. It also removes items from Pokemon such as Zapdos, Moltres, and Dragonite that this Kartana set cannot pressure much otherwise, although Dragonite and bulky Gholdengo can still set up on it. Sacred Sword is an alternative that allows Kartana to check Kingambit and pressure Ferrothorn and Melmetal more appreciably than Knock Off, although being a Defogger that cannot pressure Gholdengo at all is not preferable. Grassium Z alongside 120 EVs in Attack allows Kartana to OHKO offensive Garchomp with Bloom Doom. 136 EVs are put into HP to allow Kartana to take a couple more hits and notably allow it to take a Ogerpon-W Superpower from full health.\nKartana fits well on certain offensive teams that value its ability to offensively check Ground-types such as Great Tusk, Garchomp, and Ting-Lu. It does this while removing entry hazards and remaining fairly threatening on its own terms. It is an especially good fit on sun teams anchored by Mega Charizard Y, as they require multiple forms of hazard removal and tend to dislike facing many of the tier's Ground-types, especially Garchomp. Kartana's Synthesis also gains a boost when under sun. Kartana's inability to break bulky Gholdengo without significant support is a major hinderance, so teams utilizing it must have other ways to pressure it. Strong Ground- and Fire-types such as Great Tusk, Garchomp, Mega Charizard Y, and Heatran can assist Kartana in taking down Gholdengo and can take advantage of Kartana often forcing Gholdengo to use Recover. They can also pressure Mega Scizor, which is another problematic matchup. Kartana also synergizes well with hazard setters on its own team, as it can potentially beat Gholdengo with Spikes support and force a Knock Off onto foes reliant on Heavy-Duty Boots. Spikes setters such as Gliscor or Stealth Rock setters such as Great Tusk, Garchomp, and Kommo-o are therefore good partners. Kartana's horrible Special Defense prevents it from switching into virtually any special attacker, so teammates such as Galarian Slowking, Gliscor, and Moltres are good teammates. These three are also capable of slotting in pivoting moves, which allows them to keep up momentum for Kartana's offensive teammates. Kartana also often appreciates a second Steel-type, as it defensively functions very differently from other Steel-types due to its inability to check threats such as Tapu Lele, Mega Latios, and Mega Diancie. Gholdengo, Heatran, and Melmetal are good teammates as a result.",
    "target": "纸御剑作为一种独特的进攻型清除浓雾手，凭借其优秀的防御属性与光合作用提供的可靠回复能力，能够check地面属性威胁并清除它们布置的场地伤害。尽管对抗赛富豪时表现较为平庸，但得益于对常见撒钉手如天蝎王、古鼎鹿、雄伟牙和洗翠大剑鬼的压制能力，它仍能胜任清除浓雾手的角色。拍落作为首选补盲招式，既能对赛富豪施加一定压力，也能移除闪电鸟、火焰鸟和快龙等宝可梦的道具，这些对手纸御剑通常难以处理。不过快龙与耐久型赛富豪仍能对它‌强化。圣剑可作为替代选择，使纸御剑能check仆刀将军，并在面对坚果哑铃和美录梅塔等钢属性宝可梦时取得更显著的进展，尽管这将让它作为清除浓雾手却完全无法压力赛富豪，通常并不是个好主意。携带草Z并分配120点攻击努力值时，纸御剑的绚烂缤纷花怒放可OHKO进攻型烈咬陆鲨。此外，136点HP努力值能显著提升其承伤能力，特别是满HP时能够承受厄诡椪-水井面具的蛮力。\n纸御剑能很好地融入某些进攻性强的队伍，这些队伍依赖它来对抗地面属性宝可梦如雄伟牙、烈咬陆鲨和古鼎鹿。它不仅能清除场地伤害，还能凭借自身的高威胁性持续施压‌。纸御剑尤其适合以超级喷火龙Y为核心的晴天队，因为这类队伍需要多种清钉手段，且常因面对地面属性宝可梦特别是烈咬陆鲨陷入困境。晴天状态下，纸御剑的光合作用回复效果也会增强‌。然而，纸御剑在缺乏强力支援时难以突破耐久型赛富豪，因此队伍需配备其他压制赛富豪的手段。强力地面属性和火属性宝可梦如雄伟牙、烈咬陆鲨、超级喷火龙Y和席多蓝恩，既能协助纸御剑击败赛富豪，又能利用纸御剑强迫赛富豪使用自我再生的回合。这些队友还能压制另一个棘手的对手超级巨钳螳螂‌。纸御剑与己方撒钉手配合无间，例如在或撒菱的削弱下，它可能可以突破赛富豪，还能通过拍落削弱依赖厚底靴的对手。因此，撒菱使用者天蝎王以及雄伟牙、烈咬陆鲨和杖尾鳞甲龙等隐形岩使用者都是优秀的搭档‌。其极低的特防导致它几乎无法对任何特攻手换入，故需要伽勒尔呆呆王、天蝎王和火焰鸟等队友支持。这三个队友还能通过轮转招式，为纸御剑的队友创造进攻节奏‌。由于纸御剑的防御职能与其他钢属性宝可梦差异显著，它无法check卡璞·蝶蝶、超级拉帝欧斯和超级蒂安希等威胁，队伍中往往需要第二个钢属性队友。赛富豪、席多蓝恩和美录梅塔都是优秀的搭档，它们能弥补纸御剑的联防弱点。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]