[
  {
    "source": "Although it necessitates teammates like Necrozma-DM to not run Knock Off, Poltergeist is a strong Ghost-type attack that is very spammable due to how few Pokemon that resist Ghost there are in the tier. Dragon Tail is a decently strong Dragon-type attack that has utility for forcing out Extreme Killer Arceus, which often runs Taunt, and Ting-Lu. Of the two status options, Will-O-Wisp should be run with Defog, as it pressures Ting-Lu much more; Ting-Lu can otherwise heal off damage with Leftovers, pressure Giratina-O with Ruination, and set entry hazards. Thunder Wave pressures common switch-ins like Ho-Oh and Arceus-Fairy much more, and as such is preferred when not running Defog. Access to Defog is extremely few and far between in Ubers, and therefore Giratina-O's access to it provides immense utility. It can be critical for maintaining an advantage in entry hazard management, especially once opposing entry hazard setters like Ting-Lu are taken out of the picture. Despite this utility, other options are still available for more offensively-minded teams. Shadow Sneak is a useful priority move that becomes very strong when combined with Tera Ghost; the combination of Tera Ghost Poltergeist and Shadow Sneak will even take out Koraidon. Alternatively, Stone Edge can be used to KO Ho-Oh, which otherwise takes non-Tera Ghost Poltergeist without worry. The given EVs allow Giratina-O to survive +2 Tera Ghost Arceus's Shadow Claw as well as +2 Life Orb Arceus's Shadow Claw after Stealth Rock damage. The Speed EVs are enough to outspeed uninvested Gliscor, with the rest dumped into Attack. Tera Steel should be run on Defog sets, as it negates all of Giratina-O's normal weaknesses, allowing Giratina-O to turn the tide against many Pokemon such as Koraidon using Scale Shot and Gliscor using Toxic. Tera Poison is another option, as it provides similar utility to Tera Steel without being weak to Koraidon's Flare Blitz.\nGiratina-O is an excellent way to finish off most defensive cores in the tier, as its Defog support and ability to check Arceus-Ground, Extreme Killer Arceus, and Kyogre are very valuable. As such, classic defensive Pokemon like Necrozma-DM, Arceus-Fairy, Ting-Lu, and Arceus-Water are all fantastic partners. Miraidon deserves mention, since it can pressure Ting-Lu, Clodsire, and Gliscor extremely well, potentially leading to a huge advantage in entry hazard management. Giratina-O's Defog support can also enable some powerful wallbreakers like Choice Band Chien-Pao and Choice Specs Kyogre, which may not normally fit on most teams due to being too weak to entry hazards.\n[STRATEGY COMMENTS]\nOther Options\n====\nShadow Ball is possible over Hex to have a stronger attack in the short term; this may notably help against Dragon Dance Arceus-Ground. Calm Mind sets are a possibility, but Giratina-O's lack of recovery really limits its ability to sweep.\nChecks and Counters\n====\n**Support Arceus Formes**: Arceus formes like Arceus-Fairy and Arceus-Water can shrug off any attack Giratina-O throws at them, though neither appreciate status.\n**Ho-Oh**: Ho-Oh can handle most attacks from Giratina-O, as it has high bulk and is immune to Will-O-Wisp. However, Stone Edge, Thunder Wave, and Tera Ghost-boosted Poltergeist all threaten Ho-Oh.\n**Chip Damage**: Giratina-O has no recovery, so damage from poison, burn, or Stealth Rock can add up over time. Ting-Lu's Ruination can also greatly reduce Giratina-O's ability to check threats.",
    "target": "灵骚是一个强大的幽灵属性招式，尽管它限制了奈克洛兹玛-黄昏之鬃这样的队友携带拍落，由于在这个分级中抵抗幽灵属性招式的宝可梦极少，它非常常用。龙尾是一个相当强大的龙属性招式，具有强迫携带挑衅的神速杀手阿尔宙斯和古鼎鹿下场的能力。在两个异常状态招式选项中，磷火应该与清除浓雾一起使用，因为这对古鼎鹿施压更大；否则，古鼎鹿就可以通过吃剩的东西恢复HP，用大灾难对骑拉帝纳-起源施压，并设置场地伤害。电磁波能对常见的换入如凤王和阿尔宙斯-妖精施加更大的压力，因此在不携带清除浓雾时更受青睐。在Ubers中，能够使用清除浓雾的宝可梦极为稀少，因此，骑拉帝纳-起源这一招式为其提供了巨大的辅助能力。它在控制场地伤害方面至关重要，尤其是在对手的撒钉手如古鼎鹿被击倒之后。尽管骑拉帝纳-起源能够使用清除浓雾，但对于更具进攻性的队伍，也可以有其他选择。影子偷袭是一个极为有用的先制招式，当与太晶幽灵结合时变得非常强大，太晶幽灵的灵骚配合影子偷袭甚至可以KO故勒顿。骑拉帝纳-起源还可以携带尖石攻击，用来KO凤王，而凤王在其他情况下可以轻松承受非太晶幽灵的灵骚。给定的努力值允许骑拉帝纳-起源在+2攻击太晶幽灵阿尔宙斯的暗影爪下存活，还能在受到隐形岩伤害后在+2攻击生命宝珠阿尔宙斯的暗影爪下存活。投入的速度努力值让它足以超过未在速度端投入努力值的天蝎王，其余的投入攻击。清除浓雾配置应当携带太晶钢，因为它抵消了骑拉帝纳-起源所有原先的弱点，让骑拉帝纳-起源能够扭转许多劣势对位，例如面对使用鳞射的故勒顿和使用剧毒的天蝎王。太晶毒是另一种选择，它与太晶钢用途相似，同时还不弱故勒顿的闪焰冲锋。骑拉帝纳-起源是完善该分级大多数联防轴的绝佳选择，因为它的清除浓雾辅助以及check阿尔宙斯-地面、神速杀手阿尔宙斯和盖欧卡的能力极具价值。因此，经典的防御宝可梦如奈克洛兹玛-黄昏之鬃、阿尔宙斯-妖精、古鼎鹿和阿尔宙斯-水都是极好的搭档。值得一提的是密勒顿，因为它可以对古鼎鹿、土王和天蝎王施加巨大的压力，为控制场地伤害带来了极大的优势。骑拉帝纳-起源的清除浓雾辅助还可以使一些强大的破盾手如讲究头带古剑豹和讲究眼镜盖欧卡得以发挥，它们通常由于易受场地伤害削弱而不适合大多数队伍。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]