[
  {
    "source": "Offensive Heatran serves as an effective wallbreaker with its powerful Magma Storm and Z-Moves while also functioning as a reliable Stealth Rock setter, pressuring common entry hazard control like Tornadus-T and Terapagos. Earth Power grants key coverage against opposing Fire-resistant foes like Toxapex, Mega Diancie, and opposing Heatran. Grassium Z with Solar Beam is the main combination, as it allows Heatran to lure and OHKO Water-types such as Alomomola, Slowbro, and Mega Swampert while also dealing a good amount of damage to Mega Tyranitar and Garchomp. Alternatively, Toxic cripples threats like Ting-Lu, Mega Latios, and Mega Charizard Y, while Hidden Power Ice threatens Gliscor, Landorus-T, and Garchomp. Taunt stops walls such as Galarian Slowking and Toxapex from pivoting out or using a recovery move, letting Heatran overwhelm them with Magma Storm's chip damage. Heatran can also use Firium Z to hit foes with a powerful Inferno Overdrive, which OHKOes most Landorus-T sets. However, without the combination of Solar Beam + Grassium Z, Heatran won't break past the Water-types mentioned above. Air Balloon is another option, granting Heatran an immunity to Ground-type attacks like Landorus-T's Earthquake, Mega Charizard Y's Scorching Sands, and Mega Diancie's Earth Power, letting it beat or force out Ground-types 1-on-1 when paired with Hidden Power Ice. Air Balloon also helps Heatran against opposing Heatran by avoiding Earth Power and threatening it back with its own Earth Power. Modest nature allows Heatran to OHKO defensive Landorus-T with Inferno Overdrive, while Timid nature helps Heatran outrun Raging Bolt.\nHeatran fits best on bulky offense and balance teams, where its ability to trap and remove problematic walls shines the most. Volcarona and Raging Bolt are teammates that appreciate this ability, as they both benefit from Heatran trapping and removing walls like Toxapex and Galarian Slowking. Offensive Pokemon like Kingambit, Tapu Lele, and Mega Diancie benefit from Heatran's ability to pressure opposing Steel-types like Melmetal, Ferrothorn, and Gholdengo, and they also appreciate its access to Stealth Rock. Due to its weakness to Ground-type attacks, teammates like Landorus-T, Zapdos, and Tornadus-T are appreciated. Pokemon like Ogerpon-W, Urshifu-R, and Rillaboom are great partners thanks to their ability to threaten opposing Ground-type Pokemon, such as Ting-Lu and Great Tusk, for Heatran. Rillaboom, in particular, provides Grassy Terrain support that offers passive healing, something Z sets lack, for improved longevity. Despite the combination of Grassium Z and Solar Beam, Heatran is generally weak against Water-type foes like Slowbro, Alomomola, and Ogerpon-W; therefore, Pokemon that can handle them, such as Tapu Koko, Raging Bolt, and Ferrothorn, are great partners. Heatran also likes partners that can switch into Fighting-types, like Iron Valiant, Zamazenta, and Mega Lopunny, that threaten Heatran with an OHKO; these include Pokemon like Landorus-T, Gholdengo, and Zapdos. Teammates that carry entry hazards removal, like Gliscor and Terapagos, are solid teammates for Heatran due to its vulnerability to entry hazards and complete lack of recovery without Leftovers. Although Heatran is a solid check to offensive Pokemon like Volcarona and Tapu Lele, its lack of recovery doesn't allow it to repeatedly switch into their attacks. Therefore, defensive Pokemon that check these threats, such as Toxapex and Gholdengo, are solid partners.",
    "target": "进攻型席多蓝恩凭借其强大的熔岩风暴和Z招式成为高效的破盾手，同时也能可靠地设置隐形岩，对常见的清除浓雾手如龙卷云-灵兽和太乐巴戈斯施加压力。大地之力为席多蓝恩提供了关键的地面属性打击面，能打击到抵抗火属性招式的宝可梦，例如超坏星、超级蒂安希和其他席多蓝恩。日光束主要搭配草Z，这使席多蓝恩能够伏击并OHKO水属性宝可梦，如保姆曼波、呆壳兽和超级巨沼怪，同时也能对超级班基拉斯和烈咬陆鲨造成可观的伤害。此外，剧毒可以削弱如古鼎鹿、超级拉帝欧斯和超级喷火龙Y等威胁，而觉醒力量-冰则能威慑天蝎王、土地云-灵兽和烈咬陆鲨。挑衅可以阻止伽勒尔呆呆王和超坏星等盾牌下场或使用回复招式，让席多蓝恩通过熔岩风暴的消耗过劳它们。席多蓝恩也可以选择火Z来释放强力的超强极限爆焰弹，这一招式能OHKO大多数配置的土地云-灵兽。然而，若没有日光束搭配草Z的组合，席多蓝恩将无法突破上述水属性宝可梦。气球是另一种选择，赋予席多蓝恩对地面属性招式的免疫，如土地云-灵兽的地震、超级喷火龙Y的热沙大地和超级蒂安希的大地之力，配合觉醒力量-冰时能让席多蓝恩在一对一的情况下击败或逼退地面属性宝可梦。气球还能帮助席多蓝恩在对战中对抗其他席多蓝恩，避免被大地之力打击并用自己的大地之力威胁。内敛性格能让席多蓝恩的超强极限爆焰弹OHKO防御型土地云-灵兽，而胆小性格则帮助席多蓝恩超速猛雷鼓。\n席多蓝恩最适合搭配在平衡攻队和平衡队中，能最大程度地发挥其诱捕并清除棘手盾牌的能力。火神蛾与猛雷鼓等队友尤其青睐这一能力，因为它们需要席多蓝恩解决超坏星和伽勒尔呆呆王等阻碍它们的盾牌。仆刀将军、卡璞·蝶蝶和超级蒂安希等进攻型宝可梦则依赖席多蓝恩压制美录梅塔、坚果哑铃和赛富豪钢属性对手，同时也需要它的隐形岩。由于其地面属性弱点，席多蓝恩需要土地云-灵兽、闪电鸟和龙卷云-灵兽等队友。而厄诡椪-水井面具、武道熊师-连击流和轰擂金刚猩等伙伴能有效威慑古鼎鹿和雄伟牙等地面属性宝可梦。特别是轰擂金刚猩，其青草场地能提供HP回复，弥补Z招式配置缺乏续航的缺陷。尽管携带草Z和日光束，席多蓝恩仍难以应对呆壳兽、保姆曼波和厄诡椪-水井面具等水属性对手，因此需要卡璞·鸣鸣、猛雷鼓和坚果哑铃等可以处理它们的队友。铁武者、藏玛然特和超级长耳兔等格斗属性宝可梦可以OHKO席多蓝恩，因此它需要土地云-灵兽、赛富豪和闪电鸟等可以换挡它们的队友。由于其易受场地伤害磨损且没有携带吃剩的东西缺乏回复手段，席多蓝恩需要天蝎王和太乐巴戈斯等清钉手队友。虽然它是火神蛾和卡璞·蝶蝶坚实的check，但缺乏回复使其难以持续换挡，因此还需搭配超坏星和赛富豪等check它们的防御型宝可梦来形成坚固的联防。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]