[
  {
    "source": "Along with the utility that Hisuian Samurott usually brings, the extra bulk provided by Assault Vest allows it to better check Gholdengo and allow it to pick up surprise KOs on Pokemon such as Mega Diancie. Knock Off can remove items such as Heavy-Duty Boots from Alomomola and Toxapex and Leftovers from Ferrothorn, which makes the Spikes it sets even more impactful; Flip Turn can be run instead to help generate momentum, or Sacred Sword can be used to OHKO Kingambit. The given EV spread lets Hisuian Samurott survive a Moonblast from Mega Diancie or Solar Beam from Mega Charizard Y from full HP along with outspeeding uninvested Gliscor.\nAssault Vest Hisuian Samurott fits best on bulky offense teams that appreciate the utility and role compression it brings. Due to it being quite slow, faster Pokemon such as Zamazenta and Tapu Lele can come in to revenge kill it, so defensive Pokemon like Landorus-T and Gholdengo are helpful teammates that can switch into these threats. Gholdengo in particular can switch into Fighting- and Fairy-type attacks as well as block all forms of entry hazard removal. Pokemon that set Stealth Rock, such as Great Tusk and Landorus-T, are also appreciated, since they can stack even more hazards and accumulate extra chip damage on the opposing team; they also appreciate Hisuian Samurott removing Heavy-Duty Boots from Toxapex and Alomomola. Fairy- and Fighting-type Pokemon such as Mega Diancie, Iron Valiant, and Zamazenta greatly appreciate Hisuian Samurott being able to set hazards and chip down their checks like Ferrothorn and Gholdengo and its ability to switch into Gholdengo; in return, they threaten the Dark- and Fighting-types like Roaring Moon and opposing Zamazenta that Hisuian Samurott struggles with.",
    "target": "除了通常的功能性，洗翠大剑鬼携带突击背心带来的额外耐久使其能更好地check赛富豪，并有机会对超级蒂安希等宝可梦造成意外击杀。拍落可以移除保姆曼波和超坏星的厚底靴以及坚果哑铃的吃剩的东西，从而增强其设置的撒菱的伤害。也可选择快速折返来帮助队伍赚取节奏，或使用圣剑来OHKO仆刀将军。给定的努力值分配让洗翠大剑鬼能在满HP下承受超级蒂安希的月亮之力或超级喷火龙Y的日光束，同时速度超过未分配速度努力值的天蝎王。\n突击背心洗翠大剑鬼最适合搭配青睐其功能性与定位的平衡攻队。由于速度偏慢，它容易被藏玛然特、卡璞·蝶蝶等高速宝可梦复仇杀，因此需要土地云-灵兽、赛富豪等防御型队友联防这些威胁。其中赛富豪不仅能抵挡格斗与妖精属性招式，还能封锁对方全类型的扫钉手段。能设置隐形岩的队友如雄伟牙和土地云-灵兽同样重要，它们能进一步积累场地伤害，同时从洗翠大剑鬼移除超坏星和保姆曼波等宝可梦的道具中受益。而像超级蒂安希、铁武者和藏玛然特等妖精或格斗属性宝可梦则青睐洗翠大剑鬼的撒钉能力与对赛富豪的压制力，帮助削弱坚果哑铃和赛富豪等check；作为回报，它们能解决大剑鬼难以应对的轰鸣月等恶属性与敌方藏玛然特等格斗属性威胁。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]