[
  {
    "source": "Using the Assault Vest in combination with Regenerator makes Tornadus-T a good pivot as well as a stellar blanket check and scout to most special attackers such as Iron Valiant, Tapu Lele, and Terapagos. Its excellent Speed tier also means Tornadus-T can revenge kill threats such as Ogerpon-W, unboosted Roaring Moon, and Iron Valiant lacking Booster Energy. Bleakwind Storm is preferred for its greater accuracy compared to Hurricane and not being hindered by Mega Charizard Y’s sun, but Hurricane can be considered for its greater power, especially on rain teams, as it can OHKO Ogerpon-W after Stealth Rock. U-turn maintains momentum for wallbreakers such as Tapu Lele and Hisuian Samurott. Heat Wave hits a plethora of Steel-types such as Gholdengo, Kingambit, and Ferrothorn. Knock Off allows Tornadus-T to force meaningful progress against balance structures, removing important items from Toxapex, Ting-Lu, Heatran, and Terapagos. The given EVs allow Tornadus-T to outspeed unboosted Roaring Moon while netting a 2HKO on offensive Kingambit.\nTornadus-T can fit on both balance and offensive teams. Wallbreakers such as Raging Bolt and Ogerpon-W appreciate Tornadus-T giving them free entry against foes like Toxapex and Gliscor via U-turn while switching in on revenge killers such as Iron Valiant and Choice Scarf Tapu Lele. Pokemon like Toxapex and Slowbro form good Regenerator cores with Tornadus-T, as they, combined with Tornadus-T, can constantly switch back and forth against passive foes such as Ferrothorn and utility Gliscor. Entry hazard removal such as Terapagos, Great Tusk, and Landorus-T ease Tornadus-T’s Stealth Rock weakness, meaning it can more easily gain Regenerator recovery. Steel-types such as Heatran and bulky Gholdengo can stop Tornadus-T in its tracks, so partners like Garchomp and Mega Lopunny are solid teammates, especially because Tornadus-T can pivot them in against these foes. Pursuit users like Mega Tyranitar and Weavile are able to trap Tornadus-T and hinder its ability to consistently check foes like Iron Valiant, so insurance against these Pokemon like Zamazenta and Toxapex is appreciated. Teammates such as Ting-Lu and Ferrothorn also appreciate Tornadus-T removing Heavy-Duty Boots from Toxapex and Alomomola, allowing their hazards to affect them and effectively checking threats such as Iron Valiant and Great Tusk. In return, they stop dangers to Tornadus-T such as Raging Bolt and Zapdos. Finally, Tornadus-T can form VoltTurn cores with Pokemon like Tapu Koko and Iron Crown, which help keep up momentum and rack up chip damage alongside Tornadus-T.",
    "target": "突击背心与再生力特性结合，使得龙卷云-灵兽既能成为优秀的中转，又能check和试探铁武者、卡璞·蝶蝶、太乐巴戈斯等特攻手。其出色的速度线让它能够复仇杀厄诡椪-水井面具、未强化的轰鸣月以及没有驱劲能量的铁武者。枯叶风暴命中率更高且不受超级喷火龙Y晴天干扰因而受青睐，但仍可考虑更强威力的暴风，尤其在雨天队中配合隐形岩能OHKO厄诡椪-水井面具形态。急速折返能为卡璞·蝶蝶、洗翠大剑鬼等破盾手维持进攻节奏。热风可打击赛富豪、仆刀将军和坚果哑铃等众多钢属性目标。拍落则能移除超坏星、古鼎鹿、席多蓝恩和太乐巴戈斯的关键道具，有效压制平衡构筑。配置的努力值确保龙卷云-灵兽形态快过未强化的轰鸣月，同时基本能2HKO攻向仆刀将军。\n龙卷云-灵兽既能融入平衡队也能进入进攻体系。破盾手如猛雷鼓和厄诡椪-水井面具尤其青睐其通过急速折返为它们创造安全上场机会，从而压制超坏星与天蝎王等对手，同时还能换挡并复仇杀铁武者和围巾卡璞·蝶蝶等宝可梦。龙卷云-灵兽能与超坏星、呆壳兽等宝可梦组成再生力联防核心，三者可针对坚果哑铃和辅助型天蝎王等被动消耗型对手进行轮转消耗。太乐巴戈斯、雄伟牙和土地云-灵兽等清钉手段能缓解龙卷云-灵兽隐形岩的弱点，使其再生力回复更高效。席多蓝恩和耐久型赛富豪等钢属性宝可梦可以挡下龙卷云-灵兽，因而需要搭配烈咬陆鲨与超级长耳兔等队友，同时龙卷云-灵兽的急速折返可带它们入场。超级班基拉斯和玛狃拉等追击使用者会捕获并削弱龙卷云-灵兽check铁武者等对手的能力，因此需要携带藏玛然特和超坏星等队友。古鼎鹿与坚果哑铃可受益于龙卷云-灵兽移除超坏星和保姆曼波等对手厚底靴的能力，使场地伤害生效，同时还能帮助它们check铁武者与雄伟牙等威胁。而二者则可以阻挡猛雷鼓与闪电鸟等龙卷云-灵兽的天敌。此外，龙卷云-灵兽可与卡璞·鸣鸣、铁头壳等组成游击核心，掌控对战节奏并持续削弱对手。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]