[
  {
    "source": "With fantastic defensive and offensive stats, Iron Hands can act as a bulky setup sweeper or a strong wallbreaker for its team. Due to its amazing bulk, Iron Hands is able to setup Swords Dance reliably to punch holes through foes more easily. Ice Punch allows Iron Hands to hit Gliscor, Landorus-T and Garchomp super effectively, complementing its STAB moves nicely. Iron Hands can use Tera Water to take otherwise super effective hits from the likes of Tapu Lele, Mega Diancie, and Great Tusk, alongside gaining a resistance to Water-type moves, allowing Iron Hands to answer common rain abusers including Mega Swampert and Barraskewda, while Tera Flying makes Iron Hands immune to Ground-type moves from the likes of Landorus-T and Garchomp. The given EV spread allows Iron Hands to survive an unboosted Tapu Lele Psychic from full HP, while the Speed investment lets Iron Hands outspeed Clefable. Because of Iron Hands's poor Speed but fantastic bulk, it's more suited to bulky offense and balance teams as opposed to hyper offensive team structures. Pokemon like Landorus-T, Gliscor and Tornadus-T are fantastic teammates because they can switch into the strong Ground-type moves that threaten Iron Hands such as Great Tusk's Headlong Rush; in addition, they can all remove entry hazards, which is appreciated by Tera Flying variants, and the former two are also able to set hazards, helping Iron Hands break through teams more easily. Rillaboom can setup Grassy Terrain, weakening opposing Earthquake and giving Iron Hands more passive recovery alongside Leftovers while weakening the defensive Ground-types that could stop Iron Hands, although it should be noted Tera Flying variants will not benefit from the terrain. Defensive Steel-types such as Heatran, Ferrothorn, and Iron Crown are good teammates because they can come in on the Psychic- and Fairy- types that Iron Hands dislikes, such as Tapu Lele, Tapu Koko, Iron Valiant, and Mega Latios. Alomomola boosts Iron Hands's longevity with Wish while being a good answer to Ground-types such as Great Tusk and Garchomp. Strong special attackers such as Mega Diancie, Serperior, Tapu Lele, and Volcarona appreciate Iron Hands breaking through common special walls like Galarian Slowking, Corviknight, Ferrothorn, and Gliscor, and in return they break through physically defensive walls like Landorus-T and Dondozo. Thunder Wave users such as Galarian Slowking and Ferrothorn slow down foes such as Corviknight and Skarmory for Iron Hands to outspeed afterwards, so that it can hit them with boosted attacks before they can setup against it with Iron Defense.",
    "target": "凭借优秀的防御和攻击种族值，铁臂膀可以同时担任耐久型强化清场手或破盾手的职责。铁臂膀可靠的耐久让它能够稳定地通过剑舞来更轻松地突破对手。冰冻拳可以补充属性一致打击面，能够有效打击天蝎王、土地云-灵兽和烈咬陆鲨。铁臂膀可以通过太晶水来承受卡璞·蝶蝶、超级蒂安希和雄伟牙的克制招式，同时获得的水属性抗性也让铁臂膀更好地应对超级巨沼怪和戽斗尖梭等雨天攻击手，而太晶飞行则让铁臂膀免疫土地云-灵兽和烈咬陆鲨的地面属性招式。这种努力值分配让铁臂膀满血时能够吃下一次卡璞·蝶蝶没有强化过的精神强念，同时能够超速皮可西。因为铁臂膀有着优秀的耐久和糟糕的速度，所以相比HO它更适合BO或者平衡队。像土地云-灵兽、天蝎王和龙卷云-灵兽等都是出色的队友，因为它们能够中转雄伟牙的突飞猛扑等能威胁铁臂膀的强力地面属性招式；同时太晶飞行的配置还欣赏它们能除钉的能力，前面两个还能撒钉帮助铁臂膀更轻松地破坏对手的队伍。轰擂金刚猩能开启青草场地，在减少地震伤害的同时配合吃剩的东西给予铁臂膀更多回复，同时威胁能阻止铁臂膀的地面属性盾牌，不过要注意太晶飞行过后铁臂膀就无法享受场地的效果。席多蓝恩、坚果哑铃和铁头壳等防御型钢属性宝可梦都是不错的队友，它们能够帮助中转卡璞·蝶蝶、卡璞·鸣鸣、铁武者和超级拉帝欧斯的超能力属性和妖精属性招式。保姆曼波可以通过许愿提高铁臂膀的续航，同时也能作为雄伟牙和烈咬陆鲨等地面属性宝可梦的对策。超级蒂安希、君主蛇、卡璞·蝶蝶和火神蛾等特攻手欣赏铁臂膀能够突破伽勒尔呆呆王、钢铠鸦、坚果哑铃和天蝎王等常见的特盾，作为回报，它们能够突破土地云-灵兽和吃吼霸等物盾。伽勒尔呆呆王和坚果哑铃等电磁波使用者能够帮助铁臂膀超速钢铠鸦和盔甲鸟，让铁臂膀在它们铁壁之前用强化后的攻击打败它们。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]