[
  {
    "source": "Offensive Mega Scizor punches through the opposition with its three-attacks set thanks to its great base Attack stat, colorful coverage options, and surprisingly good natural bulk. Bullet Punch, when boosted by STAB and Technician, lets Mega Scizor beat faster threats like Roaring Moon and all-out attacking Zamazenta despite its mediocre base Speed stat. Close Combat hits Steel-types that normally stuff Mega Scizor, like Heatran and Kingambit, while being a great neutral option when boosted against the likes of Raging Bolt, opposing Mega Scizor, and Urshifu-R. Knock Off 2HKOes defensive and OHKOes offensive Gholdengo, which is otherwise a major annoyance, after a boost, while providing good utility into the likes of Toxapex and Moltres without needing a Swords Dance boost. Sand Tomb is a good alternative, as it directly breaks through Toxapex and other checks like Iron Moth while still retaining the ability to scare off Gholdengo, but it forgoes any chance of beating Moltres.\nThis particular Mega Scizor set fits best on hyper offense teams, which want Mega Scizor's cleanup ability and defensive utility without the drawbacks of being checked by annoyances like Toxapex and Heatran; not having Roost is not very noticeable due to these teams' plan to win quickly. Entry hazard setters like suicide lead Landorus-T, Glimmora, and Iron Treads greatly help Mega Scizor's wallbreaking ability by chipping foes like Toxapex and Raging Bolt down into range of Mega Scizor's attacks. They also pair well with Knock Off, allowing Mega Scizor to use said hazards to heavily pressure Moltres and Volcarona. Dragon-types like Roaring Moon, Dragonite, and Raging Bolt are great partners, as they set up on Fire-types like Heatran and Moltres that otherwise stop Mega Scizor while loving Mega Scizor's ability to beat Fairy-types like Iron Valiant and Tapu Koko and clean up once they are finished wallbreaking. Kingambit forms a great priority spamming duo with Mega Scizor, letting one wallbreak for the other to clean while appreciating Mega Scizor's neutrality to Ground and Fighting as well as its Fairy resistance, which let it switch into foes like Choice Scarf Urshifu-R, defensive Great Tusk, entry hazard setter Garchomp, and Mega Diancie.\n[CREDITS]\nWritten by:\nhttps://www.smogon.com/forums/members/dead-by-daylight.571069/\nQuality checked by:\nhttps://www.smogon.com/forums/members/lightniong.591294/\nhttps://www.smogon.com/forums/members/red-fintans.637479/\nGrammar checked by:\nhttps://www.smogon.com/forums/members/red-fintans.637479/",
    "target": "进攻型巨钳螳螂能凭借三攻配置来击穿对手的防线，这都多亏了它出色的基础攻击力、丰富的补盲招式以及出人意料的优秀耐久。技术高手特性强化的属性一致子弹拳使其即使速度种族值平庸，也能压制轰鸣月和四攻藏玛然特等高速威胁。近身战能重创通常能阻挡巨钳螳螂的钢属性宝可梦，如席多蓝恩和仆刀将军，同时在强化后对猛雷鼓、同类和武道熊师-连击流等目标造成较高的中性伤害。携带拍落能在强化后2HKO防御型赛富豪、OHKO进攻型赛富豪，否则它会成为棘手的对手，同时无需剑舞强化即可有效压制超坏星和火焰鸟等对手。流沙地狱可作为替代选项直接突破超坏星和铁毒蛾等check，同时仍保持对赛富豪的威慑力，但会彻底丧失对抗火焰鸟的能力。\n这套特定的超级巨钳螳螂配置最适合放在HO队中，这类队伍需要它的清场能力和防御能力，同时不被超坏星和席多蓝恩等麻烦的对手check；由于这类队伍追求速战速决，舍弃羽栖的缺陷并不明显。出钉手如自杀型首发土地云-灵兽、晶光花、铁辙迹能通过消耗超坏星、猛雷鼓等对手的HP，使其进入超级巨钳螳螂的斩杀线，极大提升超级巨钳螳螂的破盾能力。这些出钉手与拍落招式形成绝佳配合，让超级巨钳螳螂能利用场地伤害对火焰鸟和火神蛾等宝可梦施压。轰鸣月、快龙和猛雷鼓等龙属性宝可梦是优秀队友，它们能对席多蓝恩和火焰鸟等火属性威胁强化，而这些火属性宝可梦通常会阻挡超级巨钳螳螂；同时龙属性队友也受益于超级巨钳螳螂对抗铁武者、卡璞·鸣鸣等妖精属性宝可梦的能力，并在它们破盾后由其完成清场。仆刀将军与超级巨钳螳螂构成强力的先制招式组合，二者可互相为对方创造破盾与清场的机会。仆刀将军尤其青睐超级巨钳螳螂地面与格斗属性的中性抗性，以及对妖精属性的抗性，这使其能换挡围巾武道熊师-连击流、防御型雄伟牙、撒钉型烈咬陆鲨、超级蒂安希等对手。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]