[
  {
    "source": "Thanks to Electro Shot, Archaludon becomes a staple wallbreaker for rain teams with huge snowball potential while possessing valuable defensive utility that turns it into a strong tank for the archetype. Its typing alongside Stamina and Assault Vest makes it difficult to take down both physically and specially, letting it accumulate boosts with Electro Shot and wallbreak with its offensive movepool more consistently while taking on the tier's offensive foes comfortably; it checks common threats to rain like Ogerpon-W and Zapdos and can even trade with and prevent revenge killing attempts from a huge slew of more threats, including Pokemon like Tapu Koko, Terapagos, and Weavile. Electro Shot also provides Archaludon with a strong neutral nuke against Steel-types like Gholdengo and Iron Crown that resist its STAB combination and neglect its Fighting coverage, but more importantly, an immediate and reliable way to nail bulky Water-types like Toxapex and Alomomola that can slow down the onslaught of rain-boosted Water-type moves from its teammates. Aura Sphere makes use of Electro Shot boosts and hits Kingambit and Ferrothorn hard, even ignoring the latter's Iron Barbs, but a Stamina-complemented Body Press can be considered instead to hit the special wall in Blissey, drastically improving Archaludon's matchup against stall teams. Either Fighting-type coverage also hits other Steel-types like Heatran and Melmetal outside of rain and pressure Mega Tyranitar more than Flash Cannon, preventing it from replacing the weather more freely. 176 Speed EVs let Archaludon outpace neutral-natured base 75s like Raging Bolt and Mega Scizor.\nArchaludon's expertise makes it the perfect fit for rain teams and rain teams only. Pelipper is undoubtedly the best teammate, as it reliably sets the rain with Drizzle for Archaludon to use Electro Shot. Moreover, it pivots Archaludon in safely against switch-ins like Zapdos and Toxapex via U-turn and switches into troublesome revenge killers like Urshifu-R, Great Tusk, and Zamazenta. Offensive Water-types found on rain teams like Mega Swampert, Urshifu-R, and Barraskewda can keep up the pressure against the opposition; they appreciate Archaludon exploiting the aforementioned bulky Water-types that they can pivot it into while pressuring bulky Ground-types such as Gliscor and Ting-Lu that are otherwise tough to break through and keeping up with faster offensive threats like Mega Diancie, Garchomp, and Mega Medicham that can overrun Archaludon. Zapdos is a strong offensive threat in rain itself that can also handle Mega Lopunny, Great Tusk, and Landorus-T for Archaludon defensively, with its Static potentially allowing Archaludon to outspeed otherwise faster foes like Dragonite, Urshifu-R, and Kartana; together, they can also overwhelm shared checks like Gliscor and Ting-Lu. Ferrothorn and Iron Treads provide entry hazards to take advantage of Archaludon's forced switches and check Ogerpon-W and Zapdos, respectively, so it's not overwhelmed easily. Iron Treads and the aforementioned Pelipper can also provide hazard removal, keeping Archaludon healthy to let it fully make use of its hit-taking abilities. In return, Archaludon handles threats like Ogerpon-W and Hisuian Samurott for Iron Treads.",
    "target": "电光束将铝钢桥龙变为模范级别的雨天破盾手，具有巨大的滚雪球潜力，同时还能提供有效的防御，成为队伍坚固的盾牌。其属性组合配合持久力与突击背心，让铝钢桥龙无论在物攻端还是特攻端都难以突破，能够更可靠地利用电光束提升能力阶级并用进攻性的招式池破盾，同时轻松挡下环境中常见宝可梦的进攻。它能check许多威胁到雨天队的宝可梦，如厄诡椪-水井面具和闪电鸟，甚至可以换掉卡璞·鸣鸣、太乐巴戈斯和玛狃拉等宝可梦并阻止它们复仇杀。电光束也是强力的中性招式，打击赛富豪和铁头壳等抵抗铝钢桥龙双属性一致招式同时不被格斗属性补盲招式克制的钢属性宝可梦。更重要的是，它还能快速且可靠地削弱超坏星和保姆曼波耐久型水属性宝可梦，它们能为队友挡下被雨天增强的水属性招式的猛攻。波导弹可以利用电光束带来的能力阶级提升同时还能有力地打击仆刀将军和坚果哑铃，更可以免疫后者的铁刺。不过持久力增强的扑击可以代替它来打击幸福蛋等特盾，显著扩大铝钢桥龙对位受队的优势。两种格斗属性补盲招式都可以在雨天外打击席多蓝恩和美录梅塔等其他钢属性宝可梦，同时比加农光炮更显著地对超级班基拉斯施压，阻止其自由覆盖天气。176点速度努力值帮助铝钢桥龙超速满速75速度种族值的宝可梦，如猛雷鼓和超级巨钳螳螂。\n铝钢桥龙的能力让它极其适配雨天队，同时也只适配雨天队。大嘴鸥无疑是最好的队友，它可靠地用降雨设置雨天以便铝钢桥龙使用电光束。更进一步，它还能用急速折返带铝钢桥龙安全地对闪电鸟和超坏星等换入上场，也能换挡武道熊师-连击流、雄伟牙和藏玛然特等复仇杀手。雨天队的打手如超级巨沼怪、武道熊师-连击流和戽斗尖梭可以保持进攻压力，它们也青睐铝钢桥龙突破前文可换挡它们的耐久型水属性宝可梦的能力，并通过轮转带铝钢桥龙上场，还能压力铝钢桥龙难以突破的耐久型地面属性宝可梦，如天蝎王和古鼎鹿。这些雨天打手也可以超速比铝钢桥龙快的超级蒂安希、烈咬陆鲨和超级恰雷姆等高速威胁。闪电鸟本身是雨天队的强劲打手，同时也可以帮铝钢桥龙挡下超级长耳兔、雄伟牙和土地云-灵兽等威胁，同时静电可能麻痹对手，让铝钢桥龙得以超速快龙、武道熊师-连击流和纸御剑等高速威胁。它们可以一起过劳共同的check天蝎王和古鼎鹿。坚果哑铃和铁辙迹提供的场地伤害可配合铝钢桥龙逼换和check厄诡椪-水井面具与闪电鸟的能力，虽然二者不能同时check否则它容易过劳。铁辙迹和前文的大嘴鸥都能够清钉，保持铝钢桥龙HP健康以便更好地发挥铝钢桥龙的对攻能力。作为回报铝钢桥龙可以为铁辙迹处理厄诡椪-水井面具和洗翠大剑鬼等威胁。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]