[
  {
    "source": "Mega Charizard X is a fearsome sweeper thanks to its good stats and strong ability in Tough Claws. It’s good into foes like Ferrothorn and Corviknight and can muscle through even sturdy targets hit for neutral damage such as Ting-Lu and Rotom-W. It also has a niche as a physical attacker that’s immune to burn from Flame Body and Will-O-Wisp users such as Moltres and Rotom-W, allowing it to circumvent a good way to beat physical attackers. Earthquake allows it to hit Pokemon resistant to Flare Blitz like Heatran, Garganacl, and Toxapex. Dragon Claw is an option on teams that do not need Mega Charizard X’s defensive utility as much, as it allows Charizard to hit Dragonite, Rotom-W, and Alomomola. Roost is another option that can be used to provide Mega Charizard X with longevity throughout a battle, helping it heal from Flare Blitz recoil and entry hazard damage and allowing it to set up on Pokemon like Tapu Koko, Volcarona, and Clefable as well as threaten to wallbreak multiple times in a game. Ogerpon-W appreciates Mega Charizard X’s ability to pressure its checks like Ferrothorn and Dragonite and can wear down checks to Mega Charizard X like Alomomola and Toxapex. Pokemon like Hawlucha and Iron Boulder are good partners for Mega Charizard X, as they can chip down shared checks such as Landorus-T and Alomomola. Mega Charizard X hates taking damage from Stealth Rock, so Taunt leads like Grimmsnarl, Landorus-T, and Tapu Koko are appreciated. Grimmsnarl and Tapu Koko also set up dual screens, allowing Mega Charizard X to offset its mediocre bulk and set up much easier.",
    "target": "因优秀的数值和硬爪的加持，超级喷火龙X是个令人恐惧的清场手。它与坚果哑铃和钢铠鸦等对手都有着不错的对位，甚至能强行突破古鼎鹿和清洗洛托姆等盾牌。它也是少数能够免疫火焰鸟火焰之躯和清洗洛托姆磷火的物攻手，让它不担心灼伤这一反制物攻手的常见手段。地震能够打击席多蓝恩、盐石巨灵和超坏星等抵抗闪焰冲锋的宝可梦。对于不需要超级喷火龙X参与联防的队伍，龙爪也是一个不错的选择，让超级喷火龙X能够打击快龙、清洗洛托姆和保姆曼波。羽栖是另一个不错的选择，提供超级喷火龙X在对局中持续作战的能力，帮助治疗闪焰冲锋的反伤和钉子的伤害，也能让它对卡璞·鸣鸣、火神蛾和皮可西等宝可梦强化，并在一局游戏中多次威胁对手。厄诡椪-水井面具欣赏超级喷火龙X对坚果哑铃和快龙等check施加压力的能力，并帮助超级喷火龙X削弱保姆曼波和超坏星等check。摔角鹰人和铁磐岩等宝可梦是超级喷火龙X不错的队友，它们能够削弱土地云-灵兽和保姆曼波等它们共同的check。超级喷火龙X讨厌隐形岩的伤害，所以它欣赏长毛巨魔、土地云-灵兽和卡璞·鸣鸣等携带挑衅的首发。长毛巨魔和卡璞·鸣鸣还能开双墙来弥补超级喷火龙X平庸的耐久，使它能够更轻松地强化。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]