[
  {
    "source": "Specially Defensive Heatran is a cornerstone of the metagame, being able to check top special attackers such as Tapu Lele, Volcarona, and Serperior while also remaining a threatening offensive Pokemon. Toxic is valuable on Heatran to wear down Pokemon that can either check it or set up in front of it, such as Alomomola, Rotom-W, Mega Latias, Raging Bolt and Volcarona, whereas Stealth Rock takes advantage of Heatran's ability to act as a blanket check to most special attackers in the tier. In addition, many defensive staples such as Galarian Slowking, Ferrothorn, Toxapex, and Tornadus-T are forced to switch out of Heatran in fear of Toxic or Magma Storm, and it can also threaten many common Defoggers such as Zapdos and Corviknight, affording it many opportunities to set up Stealth Rock. Taunt is a powerful option to deny setup from the likes of Mega Latias, which could otherwise set up and eventually muscle past Heatran, while also being extremely synergistic with Heatran's other moves; in combination with Magma Storm, Heatran is able to trap pokemon such as Galarian Slowking, Toxapex, and Zapdos lacking Volt Switch, denying their recovery and Galarian Slowking's Chilly Reception. Additionaly, when paired with Toxic it is able to wear down Alomomola, which is otherwise a major roadblock for Heatran, and allows Heatran to beat it in the long run. Tera Grass provides Heatran with a resistance to Water- and Ground-Type attacks, allowing Heatran to wall Mega Charizard Y and Volcarona variants lacking Bug Buzz while also checking Ogerpon-W, additionally allowing Heatran to trap Gliscor if using Taunt and an alternative spread of 252 HP / 108 SpD / 148 Spe, which allows Heatran to outspeed Gliscor. Heatran is a powerful addition to most defensive structures thanks to its ability to check many special attackers such as Volcarona, Serperior, Mega Latios, and Tapu Lele, whereas its ability to trap Galarian Slowking and Toxapex is greatly appreciated by teammates such as Iron Valiant, Zamazenta, Urshifu-R, and Volcarona. Due to lacking both reliable recovery and an immunity to Spikes, Heatran is extremely vulnerable to hazards, and is prone to being worn down during longer battles, thus Alomomola is a powerful boon to Heatran's longevity, allowing it to remain healthy throughout a prolonged match, and is also an exceptional pivot, allowing Heatran to switch in on Pokemon such as Ferrothorn and Toxapex that commonly switch into Alomomola, providing Heatran with more opportunities to set up Stealth Rock or wear down the opposing team with Magma Storm and Toxic. Pokemon such as Zapdos, Gliscor, and Ferrothorn are able to check Pokemon such as Zamazenta, Urshifu-R, opposing Gliscor, and Ogerpon-W that Heatran struggles to deal with; the former two also utilize Defog to aid in Heatran's longevity, while the latter is able to set up Spikes to further capitalize on the many switches that Heatran forces.",
    "target": "特耐席多蓝恩是如今对战环境的重要组成部分，它既能够check环境中卡璞·蝶蝶、火神蛾和君主蛇等顶尖特攻手，同时还是一个极具威胁性的打手。剧毒对席多蓝恩来讲很有价值，它能帮助席多蓝恩削弱保姆曼波、清洗洛托姆、超级拉帝亚斯、猛雷鼓和火神蛾等席多蓝恩的check或者是试图对着席多蓝恩强化的宝可梦。而隐形岩能从席多蓝恩check分级中绝大多数特攻打手的能力中获益。除此之外，由于伽勒尔呆呆王、坚果哑铃、超坏星和龙卷云-灵兽等防御型宝可梦都因忌惮席多蓝恩的剧毒或者熔岩风暴，因此被迫换出；闪电鸟、钢铠鸦等清除浓雾使用者又受到席多蓝恩威胁，这让它有许多机会使用隐形岩。挑衅是一个极强大的招式，它能够防止超级拉帝亚斯等强化手面对席多蓝恩坐地强化强行突破。另外，挑衅和席多蓝恩的其他招式相性极佳；配合熔岩风暴，席多蓝恩可以捕获伽勒尔呆呆王、超坏星以及未携带伏特替换的闪电鸟，通过挑衅阻止它们回复或者通过冷笑话离场。此外，剧毒配合挑衅可以消耗席多蓝恩的最大阻碍——保姆曼波，同时帮助席多蓝恩在长线对局中战胜它。太晶草为席多蓝恩提供了水属性和地面属性的抗性，使得席多蓝恩能够挡住超级喷火龙Y和不带虫鸣的火神蛾。同时也能check厄诡椪-水井面具。同时，采用252HP/108特防/148速度努力值分配的席多蓝恩可以快过天蝎王而且太晶草后能利用挑衅和熔岩风暴抓捕它。席多蓝恩是队伍联防火神蛾、君主蛇、超级拉帝欧斯和卡璞·蝶蝶等诸多特攻打手的重要组件。而它捕获伽勒尔呆呆王以及超坏星的能力也造福了铁武者、藏玛然特、武道雄师-连击流、火神蛾等队友。由于缺少可靠的回复和对地钉的免疫力，席多蓝恩在面对撒菱时非常脆弱，它在长线对局中也极容易过劳倒下，因此好帮手保姆曼波能让席多蓝恩在长线作战中保持健康，席多蓝恩得以换入坚果哑铃和超坏星这些经常面对保姆曼波上场的宝可梦，为席多蓝恩使用隐形岩或者使用剧毒、熔岩风暴消耗敌方提供了条件。席多蓝恩难以处理像藏玛然特、武道雄师-连击流、天蝎王和厄诡椪-水井面具这样的宝可梦可以通过闪电鸟、天蝎王和坚果哑铃check；其中闪电鸟和天蝎王清除浓雾的能力也可以延长席多蓝恩的续航，而坚果哑铃可以通过撒菱来提升席多蓝恩对敌人的压迫效果。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]