[
  {
    "source": "Zapdos is a sturdy defensive presence that uses its unique typing and its ability in Static to consistently check a variety of common physical threats like Kartana, Mega Lopunny, and Mega Scizor. Zapdos‘s ability to threaten a variety of entry hazard setters such as Ferrothorn, Gliscor, and Landorus-T depending on the set also lets it function as a reliable entry hazard removal option. Volt Switch lets Zapdos pivot out on checks such as Heatran, Kyurem, and Mega Tyranitar, safely bringing in teammates like Great Tusk, Urshifu, and Ogerpon-W to take advantage of them, whereas Discharge lets it threaten to cripple the aforementioned threats with paralysis while also allowing it to consistently threaten Toxapex and Alomomola. Heat Wave nails Ferrothorn and Mega Scizor, preventing the former from setting up entry hazards on Zapdos and the latter from using it as setup fodder. Hidden Power Ice allows Zapdos to break through Gliscor while also dealing consistent damage to Landorus-T and Garchomp. Defog is an option over either coverage option, but using it makes Zapdos substantially worse at checking certain Pokemon. Hurricane can also be used on Defog sets over a coverage option, as it provides a relatively strong hit into all entry hazard setters; however, due to its accuracy and lack of damage output compared to the coverage moves, entry hazard setters might still be undeterred. Tera Steel lets Zapdos pivot into Tapu Lele and Iron Valiant in a pinch, while Tera Dragon lets it function as a strong check to Ogerpon-W and Barraskewda. The given EV spread lets Zapdos outspeed uninvested Garchomp while maximizing its physical bulk. Zapdos works best with powerful wallbreakers like Ogerpon-W, Mega Medicham, and Tapu Lele that greatly appreciate it bringing them in safely with Volt Switch or spreading paralysis on their checks with Discharge, which slower wallbreakers like the latter two appreciate. Zapdos is easily forced out by strong special attackers like Tapu Lele and Heatran, making checks to them such as Mega Scizor, Galarian Slowking, and your own Heatran important in forming a sturdy defensive core. Lastly, due to the holes in Zapdos’s coverage if running Defog, teammates such as Toxapex and Gliscor that can cover Pokemon like Mega Scizor, Landorus-T, and Ferrothorn are imperative. These Pokemon can also absorb Knock Off targeted at Zapdos.",
    "target": "闪电鸟是优秀的防御组件，它能用独特的属性和静电特性check纸御剑、超级长耳兔和超级巨钳螳螂等物理威胁。闪电鸟威胁坚果哑铃、天蝎王和土地云-灵兽等撒钉手的能力也让它成为不错的清钉手。伏特替换能让闪电鸟面对席多蓝恩、酋雷姆和超级班基拉斯等check时抢到节奏，轮转出雄伟牙、武道熊师和厄诡椪-水井面具等队友并让它们取得优势对位，而放电能通过麻痹削弱上述的威胁，同时更好地压制超坏星和保姆曼波。热风可以打击坚果哑铃和超级巨钳螳螂，防止它们将闪电鸟视作撒钉和强化的起点。觉醒力量冰让闪电鸟能够突破天蝎王并重创土地云-灵兽和烈咬陆鲨。清除浓雾可替换上述提到的热风和觉醒力量冰，但是会让闪电鸟失去check部分宝可梦的能力。在携带清除浓雾的配置中，暴风也是可考虑的选项，能对所有撒钉手都造成不错的伤害；但是因为它的命中率和相对其它有克制的招式更低的伤害，撒钉手可能还是会完成它们的任务。太晶钢让闪电鸟在紧要关头能够中转卡璞·蝶蝶和铁武者，而太晶龙让闪电鸟能够作为厄诡椪-水井面具和戽斗尖梭的check。这种努力值分配让闪电鸟超速未分配速度努力值的烈咬陆鲨同时最大化它的物理耐久。闪电鸟与厄诡椪-水井面具、超级恰雷姆和卡璞·蝶蝶等破盾手配合良好，它们欣赏闪电鸟能用伏特替换让它们安全登场或是用放电麻痹它们的check。闪电鸟会被席多蓝恩和卡璞·蝶蝶等特攻手轻易地逼换，所以可以携带超级巨钳螳螂、伽勒尔呆呆王和自己的席多蓝恩形成坚实的联防轴。最后，如果闪电鸟因携带了清除浓雾而造成了打击面的缺失，可以携带超坏星和天蝎王等队友帮忙处理超级巨钳螳螂、土地云-灵兽和坚果哑铃。这些宝可梦也可以帮助闪电鸟承受拍落。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]