[
  {
    "source": "Clefable‘s unique combination of an amazing ability in Magic Guard, solid bulk, and good defensive typing allow it to function as an amazing utility Pokemon and a solid defensive check to a myriad of offensive threats such as Mega Lopunny, Zamazenta, and Dragonite; it’s also a good status and Knock Off absorber. Clefable is an effective Stealth Rock user due to its ability to threaten or cripple the majority of entry hazard removers, including Great Tusk, Kartana, and Tornadus-T, forcing out the former and paralyzing the latter two. Knock Off lets Clefable cripple switch-ins like Heatran, Ferrothorn, and Galarian Slowking, severely cutting into their longevity. Thunder Wave helps Clefable incapacitate offensive threats like Volcarona, Heatran, and Ogerpon-W. Trick alongside Sticky Barb gives Clefable a more efficient tool in wearing down its sturdier switch-ins like Heatran, Ferrothorn, Gliscor, and Toxapex, opening up avenues for its teammates to sweep more easily. Leftovers can be used instead of Rocky Helmet to provide some passive recovery, letting Clefable check Mega Medicham more easily. Tera Water lets Clefable take a Steel-type attack in a pinch and is a generally useful defensive type. Clefable works best on bulkier teams that can take advantage of its durability and role compression. Entry hazard setters such as Ferrothorn, Toxapex, and Gliscor are solid partners, as they can form a potent hazard-stacking core, which is especially solid alongside Clefable’s Knock Off. The latter especially works well with Clefable, as it can pivot in on Heatran and Galarian Slowking, which both force Clefable out. Offensive Pokemon such as Volcarona, Mega Lopunny, and Weavile are also good partners, as they appreciate Clefable crippling their checks like Heatran and Toxapex. While Clefable’s bulk is solid, it is often not enough to function as a sole check to the powerful offensive threats in the tier, so it is best to pair it with a sturdier teammate like Toxapex, Slowbro, or Galarian Slowking that can scout wallbreakers and spread out the defensive load.",
    "target": "皮可西坐拥魔法守护这个顶级特性、扎实的耐久和优秀的防御向属性，这独特的组合让它作为出色的功能性宝可梦活跃着，能在物理端check许多打手，比如超级长耳兔、藏玛然特和快龙；它还能轻松帮队友应对对手的异常状态和拍落。皮可西能非常高效地撒出隐形岩，这是因为它能威胁或削弱大多数除钉手，比如说它可以逼退雄伟牙，并利用电磁波来麻痹纸御剑和龙卷云-灵兽。拍落让皮可西能够限制席多蓝恩、坚果哑铃和伽勒尔呆呆王等换入的续航能力。电磁波则能使火神蛾、席多蓝恩和厄诡椪-水井面具等威胁瘫痪。戏法配合附着针让皮可西能有效地消耗许多难以突破的换入，比如席多蓝恩、坚果哑铃、天蝎王和超坏星，从而为队友清场铺路。比起凸凸头盔，吃剩的东西能够提供一定的持续回复，让皮可西能更稳定地check超级恰雷姆。皮可西能利用太晶水来轻松吃下钢属性攻击，并且水属性总的来说是个不错的防御向属性。皮可西最适合偏受的队伍，它们能有效利用皮可西的耐久和身兼数职的能力。坚果哑铃、超坏星和天蝎王等撒钉手都是皮可西的好搭档，它们能构成一个优秀的钉攻轴，而皮可西的拍落更让它们如虎添翼。这其中天蝎王尤其适配皮可西，因为它可以换入能逼退皮可西的席多蓝恩和伽勒尔呆呆王。火神蛾、超级长耳兔和玛狃拉等攻向的宝可梦也是皮可西的好队友，它们都很欣赏皮可西能消耗席多蓝恩和超坏星等它们的check。尽管皮可西的耐久还算不错，它通常不足以独自承担这个分级夸张的火力，因此最好给它准备一个耐久更高的队友来试探破盾手并分担防守任务，比如超坏星、呆壳兽和伽勒尔呆呆王。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]