[
  {
    "source": "With its sky-high Attack stat further bolstered by Swords Dance, Kartana serves as a threatening setup sweeper. Sacred Sword hits foes such as Ferrothorn and Heatran, while Knock Off hits Galarian Slowking and Iron Crown as well as removes Heavy-Duty Boots from Flying-types like Tornadus-T and Zapdos. Giga Impact is used with Normalium Z to OHKO foes like Raging Bolt, Gouging Fire, and Zapdos after a Swords Dance. Fightinium Z allows unboosted Kartana to OHKO Heatran and Ferrothorn along with Mega Scizor, Mega Mawile, Corviknight, and Raging Bolt after a boost. Synthesis is an option to give Kartana longevity, allowing it to threaten to wallbreak multiple times per game. Grassium Z is another option for a strong STAB move once boosted, but it has less applications than the aforementioned items. A set with Protective Pads and Tera Dark can be used as well, but Kartana without a Z-Move is usually undesirable. Teammates like Iron Boulder and Gouging Fire appreciate Kartana's ability to force chip damage onto Pokemon like Landorus-T, letting them eventually power through these Pokemon late-game. Kartana is prone to getting revenge killed by offensive threats like Darkrai, Iron Valiant, and Zamazenta; as such, bulky Pokemon like Galarian Slowking and Zamazenta can check the aforementioned threats and open pathways for Kartana to sweep. In return, Kartana can threaten Gliscor and Alomomola for its partners. Speed control options like Mega Lopunny and Choice Scarf Tapu Lele are also good teammates, as they can revenge kill Pokemon like Darkrai and Iron Valiant while also forming a strong offensive core with Kartana\n.",
    "target": "通过剑舞提升后极高的攻击，纸御剑是一位充满威胁的强化清场手。圣剑能够打击坚果哑铃和席多蓝恩等钢属性宝可梦，而拍落可以在打击伽勒尔呆呆王和铁头壳的同时移除龙卷云-灵兽和闪电鸟等飞行属性宝可梦的厚底靴。终极冲击的一般Z可以在剑舞后OHKO猛雷鼓、破空焰和闪电鸟。格斗Ｚ则能在没有强化的时候OHKO席多蓝恩和坚果哑铃，同时在强化攻击过后OHKO超级巨钳螳螂、超级大嘴娃、钢铠鸦和猛雷鼓。光合作用能提高纸御剑的续航能力，让它能够在一局游戏中多次威胁对手。草Ｚ是另一个不错的选择，能够给予强化后的纸御剑一次强力的属性一致招式，但是不如上述的道具。携带部位护具和太晶恶的配置也是可行的，但没有Ｚ招式的纸御剑相对较弱。铁磐岩和破空焰等队友欣赏纸御剑能帮助消耗土地云-灵兽，让它们在残局能够强行突破。纸御剑会被达克莱伊、铁武者和藏玛然特等宝可梦复仇杀，所以它需要伽勒尔呆呆王和藏玛然特等check上述威胁并为它清场开路。作为回报，纸御剑可以为它的队友威胁天蝎王和保姆曼波。超级长耳兔和讲究围巾卡璞·蝶蝶等能帮助控制速度的选择也是不错的，它们能够复仇杀达克莱伊和铁武者，并与纸御剑形成强力的联攻轴。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]