[
  {
    "source": "With virtually perfect coverage thanks to Scrappy and a high\nA\nttack stat, Mega Lopunny is an excellent choice of speed control that can help pressure the many bulky Steel-types in the tier, such as Ferrothorn, Gholdengo, and Kingambit. Fake Out is one of Mega Lopunny's most valuable tools, as it can revenge kill weakened threats such as Speed Booster Energy Iron Valiant and Scale Shot Garchomp. U-turn makes use of Mega Lopunny's ability to force out many Pokemon by generating momentum to continue applying pressure, but Quick Attack can be used instead to further improve Mega Lopunny's revenge killing capabilities. Triple Axel is another option that can OHKO Gliscor, Landorus-T, and Dragonite, as well as dealing heavy damage to Great Tusk and Mega Latios.\nMega Lopunny is a staple for many balance and bulky offense teams as a great speed control and revenge killer. Wallbreakers such as Raging Bolt, Tapu Lele, and Kyurem appreciate Mega Lopunny bringing them onto the field and in return can threaten out its checks such as Toxapex, Great Tusk, and Zapdos. Mega Lopunny can also help put pressure on their checks in return, such as Gholdengo and Ferrothorn. Other pivots such as Landorus-T and Tapu Koko can form a VoltTurn core with Mega Lopunny, with the former setting Stealth Rock and both being able to break Toxapex. In return, Mega Lopunny helps break Ting-Lu and Ferrothorn. Since Mega Lopunny forces a lot of switches, entry hazard setters such as Ting-Lu, Hisuian Samurott, and Ferrothorn make good teammates. Due to Mega Lopunny's low defenses and weakness to hazards, defensive Pokemon such as Gholdengo, Ferrothorn, and Zapdos also make great partners, as they can switch into Fairy-, Fighting-, and Flying-type attacks from Iron Valiant and opposing Zapdos. Hazard removal from Terapagos, Zapdos, and Great Tusk is also greatly appreciated to prevent Mega Lopunny from accumulating too much chip damage from hazards.",
    "target": "凭借胆量提供的近乎完美的打击面以及高攻击种族值，超级长耳兔是优秀的速度控制选项，能有效压制环境中众多钢属性盾牌，例如坚果哑铃、赛富豪和仆刀将军。击掌奇袭是超级长耳兔的核心招式，可以收割残血目标，比如提速后的铁武者和使用鳞射后的烈咬陆鲨。超级长耳兔有强大的逼换能力，因而携带急速折返可以维持进攻节奏，但若想强化收割能力也可选择电光一闪。三旋击则是另一个可选的招式，能OHKO天蝎王、土地云-灵兽和快龙，并重创雄伟牙、超级拉帝欧斯。\n超级长耳兔作为出色的速度控制选项与复仇杀手，是众多平衡队与平衡攻队的核心成员。破盾手如猛雷鼓、卡璞·蝶蝶和酋雷姆都青睐它通过急速折返创造的登场机会，以威胁其常见check，如超坏星、雄伟牙和闪电鸟等。作为回报，超级长耳兔亦能对赛富豪和坚果哑铃等它们的check施加压力。超级长耳兔与其他中转如土地云-灵兽和卡璞·鸣鸣可构成游击体系，前者能部署隐形岩，同时二者皆具备突破超坏星的能力；作为回报，超级长耳兔可帮助突破古鼎鹿与坚果哑铃。鉴于超级长耳兔强大的逼换能力，诸如古鼎鹿、洗翠大剑鬼和坚果哑铃等撒钉手都是它的好队友。由于其防御偏低且易受场地伤害磨损，赛富豪、坚果哑铃和闪电鸟等防御型宝可梦同样重要，它们能抵挡来自铁武者与敌方闪电鸟的妖精、格斗和飞行属性招式。来自太乐巴戈斯、闪电鸟和雄伟牙的除钉支援也至关重要，可避免超级长耳兔因场地伤害磨损过度。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]