[
  {
    "source": "Swords Dance Urshifu-R functions as an amazing late-game cleaner due to its ability to boost its Speed with Trailblaze and its Attack with Swords Dance. Trailblaze allows Urshifu-R to outspeed the majority of the tier, including common Pokemon such as Mega Lopunny and even Choice Scarf users such as Tapu Lele and Landorus-T; it is best used to finish off low HP foes as a way to safely boost Speed. Aqua Jet is also an option in order to revenge kill Mega Diancie, Volcarona, and Tapu Koko at low HP. Protective Pads is used in order to ignore Static from Zapdos, Flame Body from Moltres and Volcarona, and contact damage from Ferrothorn, allowing it to break more freely.\nUrshifu-R fits primarily on hyper offense and bulky offense teams, where its strong STAB moves coupled with Swords Dance allow it to shred through defensive structures with ease. Urshifu-R is able to break through defensive pieces such as Landorus-T, Great Tusk, and Gliscor with its strong Surging Strikes, which is appreciated by teammates such as Gholdengo and Kingambit. In return, Gholdengo can beat problems such as Toxapex and Iron Valiant, and Kingambit can put pressure on switch-ins such as Slowbro. Urshifu-R is also able to threaten Steel-types such as Kingambit and Melmetal with its STAB boosted Close Combat, allowing teammates such as Tapu Lele to break through teams more easily. In return, Tapu Lele breaks through Toxapex and Mega Venusaur for Urshifu-R. Urshifu-R finds itself weak to Grass-types such as Ogerpon-W and Kartana, both of which outspeed unboosted Urshifu-R, meaning switch-ins such as Raging Bolt and Ferrothorn are appreciated. As well as this, Ferrothorn can set Stealth Rock for Urshifu-R, chipping switch-ins such as non Heavy-Duty Boots Dragonite and Raging Bolt. Urshifu-R also has trouble setting up against opposing offense and can easily be revenge killed by Pokemon such as Iron Valiant and Choice Scarf Tapu Lele before setting up, meaning switch-ins such as Gholdengo and Galarian Slowking are appreciated, with the latter also being able to bring Urshifu-R in safely via Chilly Reception.",
    "target": "剑舞武道熊师-连击流是出色的清场手，凭借起草提速与剑舞强化攻击的能力，能在残局所向披靡。起草使其能快过环境中绝大多数对手，包括常见的超级长耳兔乃至讲究围巾配置的卡璞·蝶蝶与土地云-灵兽；最佳使用时机是收割残血敌人，借此安全提升速度。水流喷射则可用来复仇杀残血的超级蒂安希、火神蛾与卡璞·鸣鸣。携带部位护具能无视闪电鸟的静电、火焰鸟和火神蛾的火焰之躯，以及坚果哑铃的接触类伤害，使其突破防线时更加自如。\n武道熊师-连击流主要适用于HO或平衡攻队，凭借强力的属性一致招式配合剑舞能轻易撕裂对手的联防体系。它能用水流连打突破土地云-灵兽、雄伟牙与天蝎王等防御核心，与赛富豪、仆刀将军等队友形成良好配合：赛富豪可解决超坏星和铁武者等威胁，仆刀将军则能压制呆壳兽等换入。武道熊师-连击流属性一致的近身战还能威慑仆刀将军、美录梅塔等钢属性宝可梦，为队友如卡璞·蝶蝶创造破盾机会；反过来卡璞·蝶蝶也能替其扫除超坏星、超级妙蛙花等障碍。武道熊师-连击流会被厄诡椪-水井面具和纸御剑等草属性宝可梦压制，它们能超速未强化的武道熊师-连击流，因此需要猛雷鼓、坚果哑铃等换入的辅助。后者还能设置隐形岩，消耗未携带厚底靴的快龙或猛雷鼓等换入。此外，武道熊师-连击流在对抗攻队时难以找到强化机会，且容易被铁武者和围巾卡璞·蝶蝶等宝可梦在强化前复仇杀，故需要赛富豪和伽勒尔呆呆王等中转。后者还能通过冷笑话使其安全换入。",
    "source_lang": "english",
    "target_lang": "chinese"
  }
]